zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CPE_PMC.h
/*
 * Copyright 1997-2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*!
 * @file S32K566_CPE_PMC.h
 * @version 2.2
 * @date 2025-10-16
 * @brief Peripheral Access Layer for S32K566_CPE_PMC
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K566_CPE_PMC_H_)  /* Check if memory map has not been already included */
#define S32K566_CPE_PMC_H_

#include "S32K566_COMMON.h"

/* ----------------------------------------------------------------------------
   -- CPE_PMC Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup CPE_PMC_Peripheral_Access_Layer CPE_PMC Peripheral Access Layer
 * @{
 */

/** CPE_PMC - Register Layout Typedef */
typedef struct CPE_PMC_Struct {
  __IO uint32_t CTRL;                              /**< Main Control Register, offset: 0x0 */
  __IO uint32_t MCR;                               /**< Memory Control Register, offset: 0x4 */
  __IO uint32_t BER;                               /**< Byte Enable Register, offset: 0x8 */
  __IO uint32_t PCR;                               /**< Program Control Register, offset: 0xC */
  __I  uint32_t RPR;                               /**< Read Pipeline Register, offset: 0x10 */
  __IO uint32_t STOPADDR;                          /**< Stop Address Register, offset: 0x14 */
  __IO uint32_t CADDR;                             /**< Column Address Register, offset: 0x18 */
  __IO uint32_t RADDR;                             /**< Row Address Register, offset: 0x1C */
  __IO uint32_t X0;                                /**< X Data Register 0, offset: 0x20 */
  __IO uint32_t X1;                                /**< X Data Register 1, offset: 0x24 */
  __IO uint32_t X2;                                /**< X Data Register 2, offset: 0x28 */
  __IO uint32_t X3;                                /**< X Data Register 3, offset: 0x2C */
  __IO uint32_t X4;                                /**< X Data Register 4, offset: 0x30 */
  __IO uint32_t X5;                                /**< X Data Register 5, offset: 0x34 */
  __IO uint32_t X6;                                /**< X Data Register 6, offset: 0x38 */
  __IO uint32_t X7;                                /**< X Data Register 7, offset: 0x3C */
  __IO uint32_t Y0;                                /**< Y Data Register 0, offset: 0x40 */
  __IO uint32_t Y1;                                /**< Y Data Register 1, offset: 0x44 */
  __IO uint32_t Y2;                                /**< Y Data Register 2, offset: 0x48 */
  __IO uint32_t Y3;                                /**< Y Data Register 3, offset: 0x4C */
  __IO uint32_t Y4;                                /**< Y Data Register 4, offset: 0x50 */
  __IO uint32_t Y5;                                /**< Y Data Register 5, offset: 0x54 */
  __IO uint32_t Y6;                                /**< Y Data Register 6, offset: 0x58 */
  __IO uint32_t Y7;                                /**< Y Data Register 7, offset: 0x5C */
  __IO uint32_t AIR;                               /**< Auxiliary Input Register, offset: 0x60 */
  __IO uint32_t AOR;                               /**< Auxiliary Output Register, offset: 0x64 */
  uint8_t RESERVED_0[24];
  __IO uint32_t DM0;                               /**< Data Mask Register 0, offset: 0x80 */
  __IO uint32_t DM1;                               /**< Data Mask Register 1, offset: 0x84 */
  __IO uint32_t DM2;                               /**< Data Mask Register 2, offset: 0x88 */
  __IO uint32_t DM3;                               /**< Data Mask Register 3, offset: 0x8C */
  __IO uint32_t DM4;                               /**< Data Mask Register 4, offset: 0x90 */
  __IO uint32_t DM5;                               /**< Data Mask Register 5, offset: 0x94 */
  __IO uint32_t DM6;                               /**< Data Mask Register 6, offset: 0x98 */
  __IO uint32_t DM7;                               /**< Data Mask Register 7, offset: 0x9C */
  uint8_t RESERVED_1[96];
  __IO uint32_t P0;                                /**< Program Register 0, offset: 0x100 */
  __IO uint32_t P1;                                /**< Program Register 1, offset: 0x104 */
  __IO uint32_t P2;                                /**< Program Register 2, offset: 0x108 */
  __IO uint32_t P3;                                /**< Program Register 3, offset: 0x10C */
  __IO uint32_t P4;                                /**< Program Register 4, offset: 0x110 */
  __IO uint32_t P5;                                /**< Program Register 5, offset: 0x114 */
  __IO uint32_t P6;                                /**< Program Register 6, offset: 0x118 */
  __IO uint32_t P7;                                /**< Program Register 7, offset: 0x11C */
  __IO uint32_t P8;                                /**< Program Register 8, offset: 0x120 */
  __IO uint32_t P9;                                /**< Program Register 9, offset: 0x124 */
  __IO uint32_t P10;                               /**< Program Register 10, offset: 0x128 */
  __IO uint32_t P11;                               /**< Program Register 11, offset: 0x12C */
  __IO uint32_t P12;                               /**< Program Register 12, offset: 0x130 */
  __IO uint32_t P13;                               /**< Program Register 13, offset: 0x134 */
  __IO uint32_t P14;                               /**< Program Register 14, offset: 0x138 */
  __IO uint32_t P15;                               /**< Program Register 15, offset: 0x13C */
  __IO uint32_t P16;                               /**< Program Register 16, offset: 0x140 */
  __IO uint32_t P17;                               /**< Program Register 17, offset: 0x144 */
  __IO uint32_t P18;                               /**< Program Register 18, offset: 0x148 */
  __IO uint32_t P19;                               /**< Program Register 19, offset: 0x14C */
  __IO uint32_t P20;                               /**< Program Register 20, offset: 0x150 */
  __IO uint32_t P21;                               /**< Program Register 21, offset: 0x154 */
  __IO uint32_t P22;                               /**< Program Register 22, offset: 0x158 */
  __IO uint32_t P23;                               /**< Program Register 23, offset: 0x15C */
  __IO uint32_t P24;                               /**< Program Register 24, offset: 0x160 */
  __IO uint32_t P25;                               /**< Program Register 25, offset: 0x164 */
  __IO uint32_t P26;                               /**< Program Register 26, offset: 0x168 */
  __IO uint32_t P27;                               /**< Program Register 27, offset: 0x16C */
  __IO uint32_t P28;                               /**< Program Register 28, offset: 0x170 */
  __IO uint32_t P29;                               /**< Program Register 29, offset: 0x174 */
  __IO uint32_t P30;                               /**< Program Register 30, offset: 0x178 */
  __IO uint32_t P31;                               /**< Program Register 31, offset: 0x17C */
  uint8_t RESERVED_2[3456];
  __I  uint32_t ITCTRL;                            /**< Integration Mode Control Register, offset: 0xF00 */
  uint8_t RESERVED_3[156];
  __IO uint32_t CLAIMSET;                          /**< Claim Tag Set Register, offset: 0xFA0 */
  __IO uint32_t CLAIMCLR;                          /**< Claim Tag Clear Register, offset: 0xFA4 */
  __I  uint32_t DEVAFF0;                           /**< Device Affinity 0 Register, offset: 0xFA8 */
  __I  uint32_t DEVAFF1;                           /**< Device Affinity 1 Register, offset: 0xFAC */
       uint32_t LAR;                               /**< Lock Access Register, offset: 0xFB0 */
       uint32_t LSR;                               /**< Lock Status Register, offset: 0xFB4 */
       uint32_t AUTHSTATUS;                        /**< Authentication Status Register, offset: 0xFB8 */
  __I  uint32_t DEVARCH;                           /**< Device Architecture Register, offset: 0xFBC */
       uint32_t DEVID2;                            /**< Device ID Register 2, offset: 0xFC0 */
       uint32_t DEVID1;                            /**< Device ID Register 1, offset: 0xFC4 */
       uint32_t DEVID;                             /**< Device ID Register, offset: 0xFC8 */
  __I  uint32_t DEVTYPE;                           /**< Device Type Identifier Register, offset: 0xFCC */
  __I  uint32_t PIDR4;                             /**< Peripheral Identification Register 4, offset: 0xFD0 */
       uint32_t PIDR5;                             /**< Peripheral Identification Register 5, offset: 0xFD4 */
       uint32_t PIDR6;                             /**< Peripheral Identification Register 6, offset: 0xFD8 */
       uint32_t PIDR7;                             /**< Peripheral Identification Register 7, offset: 0xFDC */
  __I  uint32_t PIDR0;                             /**< Peripheral Identification Register 0, offset: 0xFE0 */
  __I  uint32_t PIDR1;                             /**< Peripheral Identification Register 1, offset: 0xFE4 */
  __I  uint32_t PIDR2;                             /**< Peripheral Identification Register 2, offset: 0xFE8 */
  __I  uint32_t PIDR3;                             /**< Peripheral Identification Register 3, offset: 0xFEC */
  __I  uint32_t CIDR0;                             /**< Component Identification Register 0, offset: 0xFF0 */
  __I  uint32_t CIDR1;                             /**< Component Identification Register 1, offset: 0xFF4 */
  __I  uint32_t CIDR2;                             /**< Component Identification Register 2, offset: 0xFF8 */
  __I  uint32_t CIDR3;                             /**< Component Identification Register 3, offset: 0xFFC */
} CPE_PMC_Type, *CPE_PMC_MemMapPtr;

/** Number of instances of the CPE_PMC module. */
#define CPE_PMC_INSTANCE_COUNT                   (1u)

/* CPE_PMC - Peripheral instance base addresses */
/** Peripheral CPE_PMC base address */
#define IP_CPE_PMC_BASE                          (0x4107C000u)
/** Peripheral CPE_PMC base pointer */
#define IP_CPE_PMC                               ((CPE_PMC_Type *)IP_CPE_PMC_BASE)
/** Array initializer of CPE_PMC peripheral base addresses */
#define IP_CPE_PMC_BASE_ADDRS                    { IP_CPE_PMC_BASE }
/** Array initializer of CPE_PMC peripheral base pointers */
#define IP_CPE_PMC_BASE_PTRS                     { IP_CPE_PMC }

/* ----------------------------------------------------------------------------
   -- CPE_PMC Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup CPE_PMC_Register_Masks CPE_PMC Register Masks
 * @{
 */

