zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CPE_PMC.h
/*! @name CTRL - Main Control Register */
/*! @{ */

#define CPE_PMC_CTRL_PEEN_MASK                   (0x1U)
#define CPE_PMC_CTRL_PEEN_SHIFT                  (0U)
#define CPE_PMC_CTRL_PEEN_WIDTH                  (1U)
#define CPE_PMC_CTRL_PEEN(x)                     (((uint32_t)(((uint32_t)(x)) << CPE_PMC_CTRL_PEEN_SHIFT)) & CPE_PMC_CTRL_PEEN_MASK)

#define CPE_PMC_CTRL_PES_MASK                    (0x2U)
#define CPE_PMC_CTRL_PES_SHIFT                   (1U)
#define CPE_PMC_CTRL_PES_WIDTH                   (1U)
#define CPE_PMC_CTRL_PES(x)                      (((uint32_t)(((uint32_t)(x)) << CPE_PMC_CTRL_PES_SHIFT)) & CPE_PMC_CTRL_PES_MASK)

#define CPE_PMC_CTRL_TCSEN_MASK                  (0x4U)
#define CPE_PMC_CTRL_TCSEN_SHIFT                 (2U)
#define CPE_PMC_CTRL_TCSEN_WIDTH                 (1U)
#define CPE_PMC_CTRL_TCSEN(x)                    (((uint32_t)(((uint32_t)(x)) << CPE_PMC_CTRL_TCSEN_SHIFT)) & CPE_PMC_CTRL_TCSEN_MASK)

#define CPE_PMC_CTRL_EXECO_MASK                  (0x8U)
#define CPE_PMC_CTRL_EXECO_SHIFT                 (3U)
#define CPE_PMC_CTRL_EXECO_WIDTH                 (1U)
#define CPE_PMC_CTRL_EXECO(x)                    (((uint32_t)(((uint32_t)(x)) << CPE_PMC_CTRL_EXECO_SHIFT)) & CPE_PMC_CTRL_EXECO_MASK)

#define CPE_PMC_CTRL_STOPF_MASK                  (0x10U)
#define CPE_PMC_CTRL_STOPF_SHIFT                 (4U)
#define CPE_PMC_CTRL_STOPF_WIDTH                 (1U)
#define CPE_PMC_CTRL_STOPF(x)                    (((uint32_t)(((uint32_t)(x)) << CPE_PMC_CTRL_STOPF_SHIFT)) & CPE_PMC_CTRL_STOPF_MASK)

#define CPE_PMC_CTRL_TE_MASK                     (0x20U)
#define CPE_PMC_CTRL_TE_SHIFT                    (5U)
#define CPE_PMC_CTRL_TE_WIDTH                    (1U)
#define CPE_PMC_CTRL_TE(x)                       (((uint32_t)(((uint32_t)(x)) << CPE_PMC_CTRL_TE_SHIFT)) & CPE_PMC_CTRL_TE_MASK)

#define CPE_PMC_CTRL_TESEN_MASK                  (0x40U)
#define CPE_PMC_CTRL_TESEN_SHIFT                 (6U)
#define CPE_PMC_CTRL_TESEN_WIDTH                 (1U)
#define CPE_PMC_CTRL_TESEN(x)                    (((uint32_t)(((uint32_t)(x)) << CPE_PMC_CTRL_TESEN_SHIFT)) & CPE_PMC_CTRL_TESEN_MASK)

#define CPE_PMC_CTRL_TF_MASK                     (0x80U)
#define CPE_PMC_CTRL_TF_SHIFT                    (7U)
#define CPE_PMC_CTRL_TF_WIDTH                    (1U)
#define CPE_PMC_CTRL_TF(x)                       (((uint32_t)(((uint32_t)(x)) << CPE_PMC_CTRL_TF_SHIFT)) & CPE_PMC_CTRL_TF_MASK)

#define CPE_PMC_CTRL_TFSEN_MASK                  (0x100U)
#define CPE_PMC_CTRL_TFSEN_SHIFT                 (8U)
#define CPE_PMC_CTRL_TFSEN_WIDTH                 (1U)
#define CPE_PMC_CTRL_TFSEN(x)                    (((uint32_t)(((uint32_t)(x)) << CPE_PMC_CTRL_TFSEN_SHIFT)) & CPE_PMC_CTRL_TFSEN_MASK)

#define CPE_PMC_CTRL_ADDRCD_MASK                 (0x200U)
#define CPE_PMC_CTRL_ADDRCD_SHIFT                (9U)
#define CPE_PMC_CTRL_ADDRCD_WIDTH                (1U)
#define CPE_PMC_CTRL_ADDRCD(x)                   (((uint32_t)(((uint32_t)(x)) << CPE_PMC_CTRL_ADDRCD_SHIFT)) & CPE_PMC_CTRL_ADDRCD_MASK)

#define CPE_PMC_CTRL_ADDRID_MASK                 (0x400U)
#define CPE_PMC_CTRL_ADDRID_SHIFT                (10U)
#define CPE_PMC_CTRL_ADDRID_WIDTH                (1U)
#define CPE_PMC_CTRL_ADDRID(x)                   (((uint32_t)(((uint32_t)(x)) << CPE_PMC_CTRL_ADDRID_SHIFT)) & CPE_PMC_CTRL_ADDRID_MASK)

#define CPE_PMC_CTRL_TEN_MASK                    (0x800U)
#define CPE_PMC_CTRL_TEN_SHIFT                   (11U)
#define CPE_PMC_CTRL_TEN_WIDTH                   (1U)
#define CPE_PMC_CTRL_TEN(x)                      (((uint32_t)(((uint32_t)(x)) << CPE_PMC_CTRL_TEN_SHIFT)) & CPE_PMC_CTRL_TEN_MASK)

#define CPE_PMC_CTRL_STATE_MASK                  (0x3000U)
#define CPE_PMC_CTRL_STATE_SHIFT                 (12U)
#define CPE_PMC_CTRL_STATE_WIDTH                 (2U)
#define CPE_PMC_CTRL_STATE(x)                    (((uint32_t)(((uint32_t)(x)) << CPE_PMC_CTRL_STATE_SHIFT)) & CPE_PMC_CTRL_STATE_MASK)

#define CPE_PMC_CTRL_MBISTACK_MASK               (0x4000U)
#define CPE_PMC_CTRL_MBISTACK_SHIFT              (14U)
#define CPE_PMC_CTRL_MBISTACK_WIDTH              (1U)
#define CPE_PMC_CTRL_MBISTACK(x)                 (((uint32_t)(((uint32_t)(x)) << CPE_PMC_CTRL_MBISTACK_SHIFT)) & CPE_PMC_CTRL_MBISTACK_MASK)

#define CPE_PMC_CTRL_MBISTCFG_MASK               (0xFFFF0000U)
#define CPE_PMC_CTRL_MBISTCFG_SHIFT              (16U)
#define CPE_PMC_CTRL_MBISTCFG_WIDTH              (16U)
#define CPE_PMC_CTRL_MBISTCFG(x)                 (((uint32_t)(((uint32_t)(x)) << CPE_PMC_CTRL_MBISTCFG_SHIFT)) & CPE_PMC_CTRL_MBISTCFG_MASK)
/*! @} */

/*! @name MCR - Memory Control Register */
/*! @{ */

#define CPE_PMC_MCR_ARRAY_MASK                   (0xFFU)
#define CPE_PMC_MCR_ARRAY_SHIFT                  (0U)
#define CPE_PMC_MCR_ARRAY_WIDTH                  (8U)
#define CPE_PMC_MCR_ARRAY(x)                     (((uint32_t)(((uint32_t)(x)) << CPE_PMC_MCR_ARRAY_SHIFT)) & CPE_PMC_MCR_ARRAY_MASK)

#define CPE_PMC_MCR_PD_MASK                      (0x1F00U)
#define CPE_PMC_MCR_PD_SHIFT                     (8U)
#define CPE_PMC_MCR_PD_WIDTH                     (5U)
#define CPE_PMC_MCR_PD(x)                        (((uint32_t)(((uint32_t)(x)) << CPE_PMC_MCR_PD_SHIFT)) & CPE_PMC_MCR_PD_MASK)

#define CPE_PMC_MCR_RCO_MASK                     (0x1E000U)
#define CPE_PMC_MCR_RCO_SHIFT                    (13U)
#define CPE_PMC_MCR_RCO_WIDTH                    (4U)
#define CPE_PMC_MCR_RCO(x)                       (((uint32_t)(((uint32_t)(x)) << CPE_PMC_MCR_RCO_SHIFT)) & CPE_PMC_MCR_RCO_MASK)

#define CPE_PMC_MCR_CCW_MASK                     (0x60000U)
#define CPE_PMC_MCR_CCW_SHIFT                    (17U)
#define CPE_PMC_MCR_CCW_WIDTH                    (2U)
#define CPE_PMC_MCR_CCW(x)                       (((uint32_t)(((uint32_t)(x)) << CPE_PMC_MCR_CCW_SHIFT)) & CPE_PMC_MCR_CCW_MASK)

#define CPE_PMC_MCR_RCW_MASK                     (0x3E00000U)
#define CPE_PMC_MCR_RCW_SHIFT                    (21U)
#define CPE_PMC_MCR_RCW_WIDTH                    (5U)
#define CPE_PMC_MCR_RCW(x)                       (((uint32_t)(((uint32_t)(x)) << CPE_PMC_MCR_RCW_SHIFT)) & CPE_PMC_MCR_RCW_MASK)
/*! @} */

/*! @name BER - Byte Enable Register */
/*! @{ */

#define CPE_PMC_BER_BE_MASK                      (0xFFFFFFFFU)
#define CPE_PMC_BER_BE_SHIFT                     (0U)
#define CPE_PMC_BER_BE_WIDTH                     (32U)
#define CPE_PMC_BER_BE(x)                        (((uint32_t)(((uint32_t)(x)) << CPE_PMC_BER_BE_SHIFT)) & CPE_PMC_BER_BE_MASK)
/*! @} */

/*! @name PCR - Program Control Register */
/*! @{ */

#define CPE_PMC_PCR_PC_MASK                      (0x1FU)
#define CPE_PMC_PCR_PC_SHIFT                     (0U)
#define CPE_PMC_PCR_PC_WIDTH                     (5U)
#define CPE_PMC_PCR_PC(x)                        (((uint32_t)(((uint32_t)(x)) << CPE_PMC_PCR_PC_SHIFT)) & CPE_PMC_PCR_PC_MASK)
/*! @} */

/*! @name RPR - Read Pipeline Register */
/*! @{ */

#define CPE_PMC_RPR_R_MASK                       (0xFFFFFFFFU)
#define CPE_PMC_RPR_R_SHIFT                      (0U)
#define CPE_PMC_RPR_R_WIDTH                      (32U)
#define CPE_PMC_RPR_R(x)                         (((uint32_t)(((uint32_t)(x)) << CPE_PMC_RPR_R_SHIFT)) & CPE_PMC_RPR_R_MASK)
/*! @} */

/*! @name STOPADDR - Stop Address Register */
/*! @{ */

#define CPE_PMC_STOPADDR_SA_MASK                 (0xFFFFFFFFU)
#define CPE_PMC_STOPADDR_SA_SHIFT                (0U)
#define CPE_PMC_STOPADDR_SA_WIDTH                (32U)
#define CPE_PMC_STOPADDR_SA(x)                   (((uint32_t)(((uint32_t)(x)) << CPE_PMC_STOPADDR_SA_SHIFT)) & CPE_PMC_STOPADDR_SA_MASK)
/*! @} */

/*! @name CADDR - Column Address Register */
/*! @{ */

#define CPE_PMC_CADDR_CA_MASK                    (0x1FU)
#define CPE_PMC_CADDR_CA_SHIFT                   (0U)
#define CPE_PMC_CADDR_CA_WIDTH                   (5U)
#define CPE_PMC_CADDR_CA(x)                      (((uint32_t)(((uint32_t)(x)) << CPE_PMC_CADDR_CA_SHIFT)) & CPE_PMC_CADDR_CA_MASK)
/*! @} */

/*! @name RADDR - Row Address Register */
/*! @{ */

#define CPE_PMC_RADDR_RA_MASK                    (0x3FFFFFFFU)
#define CPE_PMC_RADDR_RA_SHIFT                   (0U)
#define CPE_PMC_RADDR_RA_WIDTH                   (30U)
#define CPE_PMC_RADDR_RA(x)                      (((uint32_t)(((uint32_t)(x)) << CPE_PMC_RADDR_RA_SHIFT)) & CPE_PMC_RADDR_RA_MASK)
/*! @} */

/*! @name X0 - X Data Register 0 */
/*! @{ */

#define CPE_PMC_X0_X0_MASK                       (0xFFFFFFFFU)
#define CPE_PMC_X0_X0_SHIFT                      (0U)
#define CPE_PMC_X0_X0_WIDTH                      (32U)
#define CPE_PMC_X0_X0(x)                         (((uint32_t)(((uint32_t)(x)) << CPE_PMC_X0_X0_SHIFT)) & CPE_PMC_X0_X0_MASK)
/*! @} */

/*! @name X1 - X Data Register 1 */
/*! @{ */

#define CPE_PMC_X1_X1_MASK                       (0xFFFFFFFFU)
#define CPE_PMC_X1_X1_SHIFT                      (0U)
#define CPE_PMC_X1_X1_WIDTH                      (32U)
#define CPE_PMC_X1_X1(x)                         (((uint32_t)(((uint32_t)(x)) << CPE_PMC_X1_X1_SHIFT)) & CPE_PMC_X1_X1_MASK)
/*! @} */

/*! @name X2 - X Data Register 2 */
/*! @{ */

#define CPE_PMC_X2_X2_MASK                       (0xFFFFFFFFU)
#define CPE_PMC_X2_X2_SHIFT                      (0U)
#define CPE_PMC_X2_X2_WIDTH                      (32U)
#define CPE_PMC_X2_X2(x)                         (((uint32_t)(((uint32_t)(x)) << CPE_PMC_X2_X2_SHIFT)) & CPE_PMC_X2_X2_MASK)
/*! @} */

/*! @name X3 - X Data Register 3 */
/*! @{ */

#define CPE_PMC_X3_X3_MASK                       (0xFFFFFFFFU)
#define CPE_PMC_X3_X3_SHIFT                      (0U)
#define CPE_PMC_X3_X3_WIDTH                      (32U)
#define CPE_PMC_X3_X3(x)                         (((uint32_t)(((uint32_t)(x)) << CPE_PMC_X3_X3_SHIFT)) & CPE_PMC_X3_X3_MASK)
/*! @} */

/*! @name X4 - X Data Register 4 */
/*! @{ */

#define CPE_PMC_X4_X4_MASK                       (0xFFFFFFFFU)
#define CPE_PMC_X4_X4_SHIFT                      (0U)
#define CPE_PMC_X4_X4_WIDTH                      (32U)
#define CPE_PMC_X4_X4(x)                         (((uint32_t)(((uint32_t)(x)) << CPE_PMC_X4_X4_SHIFT)) & CPE_PMC_X4_X4_MASK)
/*! @} */

/*! @name X5 - X Data Register 5 */
/*! @{ */

#define CPE_PMC_X5_X5_MASK                       (0xFFFFFFFFU)
#define CPE_PMC_X5_X5_SHIFT                      (0U)
#define CPE_PMC_X5_X5_WIDTH                      (32U)
#define CPE_PMC_X5_X5(x)                         (((uint32_t)(((uint32_t)(x)) << CPE_PMC_X5_X5_SHIFT)) & CPE_PMC_X5_X5_MASK)
/*! @} */

/*! @name X6 - X Data Register 6 */
/*! @{ */

#define CPE_PMC_X6_X6_MASK                       (0xFFFFFFFFU)
#define CPE_PMC_X6_X6_SHIFT                      (0U)
#define CPE_PMC_X6_X6_WIDTH                      (32U)
#define CPE_PMC_X6_X6(x)                         (((uint32_t)(((uint32_t)(x)) << CPE_PMC_X6_X6_SHIFT)) & CPE_PMC_X6_X6_MASK)
/*! @} */

/*! @name X7 - X Data Register 7 */
/*! @{ */

#define CPE_PMC_X7_X7_MASK                       (0xFFFFFFFFU)
#define CPE_PMC_X7_X7_SHIFT                      (0U)
#define CPE_PMC_X7_X7_WIDTH                      (32U)
#define CPE_PMC_X7_X7(x)                         (((uint32_t)(((uint32_t)(x)) << CPE_PMC_X7_X7_SHIFT)) & CPE_PMC_X7_X7_MASK)
/*! @} */

/*! @name Y0 - Y Data Register 0 */
/*! @{ */

#define CPE_PMC_Y0_Y0_MASK                       (0xFFFFFFFFU)
#define CPE_PMC_Y0_Y0_SHIFT                      (0U)
#define CPE_PMC_Y0_Y0_WIDTH                      (32U)
#define CPE_PMC_Y0_Y0(x)                         (((uint32_t)(((uint32_t)(x)) << CPE_PMC_Y0_Y0_SHIFT)) & CPE_PMC_Y0_Y0_MASK)
/*! @} */

/*! @name Y1 - Y Data Register 1 */
/*! @{ */

#define CPE_PMC_Y1_Y1_MASK                       (0xFFFFFFFFU)
#define CPE_PMC_Y1_Y1_SHIFT                      (0U)
#define CPE_PMC_Y1_Y1_WIDTH                      (32U)
#define CPE_PMC_Y1_Y1(x)                         (((uint32_t)(((uint32_t)(x)) << CPE_PMC_Y1_Y1_SHIFT)) & CPE_PMC_Y1_Y1_MASK)
/*! @} */

/*! @name Y2 - Y Data Register 2 */
/*! @{ */

#define CPE_PMC_Y2_Y2_MASK                       (0xFFFFFFFFU)
#define CPE_PMC_Y2_Y2_SHIFT                      (0U)
#define CPE_PMC_Y2_Y2_WIDTH                      (32U)
#define CPE_PMC_Y2_Y2(x)                         (((uint32_t)(((uint32_t)(x)) << CPE_PMC_Y2_Y2_SHIFT)) & CPE_PMC_Y2_Y2_MASK)
/*! @} */

/*! @name Y3 - Y Data Register 3 */
/*! @{ */

#define CPE_PMC_Y3_Y3_MASK                       (0xFFFFFFFFU)
#define CPE_PMC_Y3_Y3_SHIFT                      (0U)
#define CPE_PMC_Y3_Y3_WIDTH                      (32U)
#define CPE_PMC_Y3_Y3(x)                         (((uint32_t)(((uint32_t)(x)) << CPE_PMC_Y3_Y3_SHIFT)) & CPE_PMC_Y3_Y3_MASK)
/*! @} */

/*! @name Y4 - Y Data Register 4 */
/*! @{ */

#define CPE_PMC_Y4_Y4_MASK                       (0xFFFFFFFFU)
#define CPE_PMC_Y4_Y4_SHIFT                      (0U)
#define CPE_PMC_Y4_Y4_WIDTH                      (32U)
#define CPE_PMC_Y4_Y4(x)                         (((uint32_t)(((uint32_t)(x)) << CPE_PMC_Y4_Y4_SHIFT)) & CPE_PMC_Y4_Y4_MASK)
/*! @} */

/*! @name Y5 - Y Data Register 5 */
/*! @{ */

#define CPE_PMC_Y5_Y5_MASK                       (0xFFFFFFFFU)
#define CPE_PMC_Y5_Y5_SHIFT                      (0U)
#define CPE_PMC_Y5_Y5_WIDTH                      (32U)
#define CPE_PMC_Y5_Y5(x)                         (((uint32_t)(((uint32_t)(x)) << CPE_PMC_Y5_Y5_SHIFT)) & CPE_PMC_Y5_Y5_MASK)
/*! @} */

/*! @name Y6 - Y Data Register 6 */
/*! @{ */

#define CPE_PMC_Y6_Y6_MASK                       (0xFFFFFFFFU)
#define CPE_PMC_Y6_Y6_SHIFT                      (0U)
#define CPE_PMC_Y6_Y6_WIDTH                      (32U)
#define CPE_PMC_Y6_Y6(x)                         (((uint32_t)(((uint32_t)(x)) << CPE_PMC_Y6_Y6_SHIFT)) & CPE_PMC_Y6_Y6_MASK)
/*! @} */

/*! @name Y7 - Y Data Register 7 */
/*! @{ */

#define CPE_PMC_Y7_Y7_MASK                       (0xFFFFFFFFU)
#define CPE_PMC_Y7_Y7_SHIFT                      (0U)
#define CPE_PMC_Y7_Y7_WIDTH                      (32U)
#define CPE_PMC_Y7_Y7(x)                         (((uint32_t)(((uint32_t)(x)) << CPE_PMC_Y7_Y7_SHIFT)) & CPE_PMC_Y7_Y7_MASK)
/*! @} */

/*! @name AIR - Auxiliary Input Register */
/*! @{ */

#define CPE_PMC_AIR_AIR_MASK                     (0xFFFFFFFFU)
#define CPE_PMC_AIR_AIR_SHIFT                    (0U)
#define CPE_PMC_AIR_AIR_WIDTH                    (32U)
#define CPE_PMC_AIR_AIR(x)                       (((uint32_t)(((uint32_t)(x)) << CPE_PMC_AIR_AIR_SHIFT)) & CPE_PMC_AIR_AIR_MASK)
/*! @} */

/*! @name AOR - Auxiliary Output Register */
/*! @{ */

