zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CPE_PMC.h
#define CPE_PMC_AOR_AOR_MASK                     (0xFFFFFFFFU)
#define CPE_PMC_AOR_AOR_SHIFT                    (0U)
#define CPE_PMC_AOR_AOR_WIDTH                    (32U)
#define CPE_PMC_AOR_AOR(x)                       (((uint32_t)(((uint32_t)(x)) << CPE_PMC_AOR_AOR_SHIFT)) & CPE_PMC_AOR_AOR_MASK)
/*! @} */

/*! @name DM0 - Data Mask Register 0 */
/*! @{ */

#define CPE_PMC_DM0_DM0_MASK                     (0xFFFFFFFFU)
#define CPE_PMC_DM0_DM0_SHIFT                    (0U)
#define CPE_PMC_DM0_DM0_WIDTH                    (32U)
#define CPE_PMC_DM0_DM0(x)                       (((uint32_t)(((uint32_t)(x)) << CPE_PMC_DM0_DM0_SHIFT)) & CPE_PMC_DM0_DM0_MASK)
/*! @} */

/*! @name DM1 - Data Mask Register 1 */
/*! @{ */

#define CPE_PMC_DM1_DM1_MASK                     (0xFFFFFFFFU)
#define CPE_PMC_DM1_DM1_SHIFT                    (0U)
#define CPE_PMC_DM1_DM1_WIDTH                    (32U)
#define CPE_PMC_DM1_DM1(x)                       (((uint32_t)(((uint32_t)(x)) << CPE_PMC_DM1_DM1_SHIFT)) & CPE_PMC_DM1_DM1_MASK)
/*! @} */

/*! @name DM2 - Data Mask Register 2 */
/*! @{ */

#define CPE_PMC_DM2_DM2_MASK                     (0xFFFFFFFFU)
#define CPE_PMC_DM2_DM2_SHIFT                    (0U)
#define CPE_PMC_DM2_DM2_WIDTH                    (32U)
#define CPE_PMC_DM2_DM2(x)                       (((uint32_t)(((uint32_t)(x)) << CPE_PMC_DM2_DM2_SHIFT)) & CPE_PMC_DM2_DM2_MASK)
/*! @} */

/*! @name DM3 - Data Mask Register 3 */
/*! @{ */

#define CPE_PMC_DM3_DM3_MASK                     (0xFFFFFFFFU)
#define CPE_PMC_DM3_DM3_SHIFT                    (0U)
#define CPE_PMC_DM3_DM3_WIDTH                    (32U)
#define CPE_PMC_DM3_DM3(x)                       (((uint32_t)(((uint32_t)(x)) << CPE_PMC_DM3_DM3_SHIFT)) & CPE_PMC_DM3_DM3_MASK)
/*! @} */

/*! @name DM4 - Data Mask Register 4 */
/*! @{ */

#define CPE_PMC_DM4_DM4_MASK                     (0xFFFFFFFFU)
#define CPE_PMC_DM4_DM4_SHIFT                    (0U)
#define CPE_PMC_DM4_DM4_WIDTH                    (32U)
#define CPE_PMC_DM4_DM4(x)                       (((uint32_t)(((uint32_t)(x)) << CPE_PMC_DM4_DM4_SHIFT)) & CPE_PMC_DM4_DM4_MASK)
/*! @} */

/*! @name DM5 - Data Mask Register 5 */
/*! @{ */

#define CPE_PMC_DM5_DM5_MASK                     (0xFFFFFFFFU)
#define CPE_PMC_DM5_DM5_SHIFT                    (0U)
#define CPE_PMC_DM5_DM5_WIDTH                    (32U)
#define CPE_PMC_DM5_DM5(x)                       (((uint32_t)(((uint32_t)(x)) << CPE_PMC_DM5_DM5_SHIFT)) & CPE_PMC_DM5_DM5_MASK)
/*! @} */

/*! @name DM6 - Data Mask Register 6 */
/*! @{ */

#define CPE_PMC_DM6_DM6_MASK                     (0xFFFFFFFFU)
#define CPE_PMC_DM6_DM6_SHIFT                    (0U)
#define CPE_PMC_DM6_DM6_WIDTH                    (32U)
#define CPE_PMC_DM6_DM6(x)                       (((uint32_t)(((uint32_t)(x)) << CPE_PMC_DM6_DM6_SHIFT)) & CPE_PMC_DM6_DM6_MASK)
/*! @} */

/*! @name DM7 - Data Mask Register 7 */
/*! @{ */

#define CPE_PMC_DM7_DM7_MASK                     (0xFFFFFFFFU)
#define CPE_PMC_DM7_DM7_SHIFT                    (0U)
#define CPE_PMC_DM7_DM7_WIDTH                    (32U)
#define CPE_PMC_DM7_DM7(x)                       (((uint32_t)(((uint32_t)(x)) << CPE_PMC_DM7_DM7_SHIFT)) & CPE_PMC_DM7_DM7_MASK)
/*! @} */

/*! @name P0 - Program Register 0 */
/*! @{ */

#define CPE_PMC_P0_OP_MASK                       (0x3U)
#define CPE_PMC_P0_OP_SHIFT                      (0U)
#define CPE_PMC_P0_OP_WIDTH                      (2U)
#define CPE_PMC_P0_OP(x)                         (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P0_OP_SHIFT)) & CPE_PMC_P0_OP_MASK)

#define CPE_PMC_P0_TRANS_MASK                    (0x30U)
#define CPE_PMC_P0_TRANS_SHIFT                   (4U)
#define CPE_PMC_P0_TRANS_WIDTH                   (2U)
#define CPE_PMC_P0_TRANS(x)                      (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P0_TRANS_SHIFT)) & CPE_PMC_P0_TRANS_MASK)

#define CPE_PMC_P0_DREG_MASK                     (0x40U)
#define CPE_PMC_P0_DREG_SHIFT                    (6U)
#define CPE_PMC_P0_DREG_WIDTH                    (1U)
#define CPE_PMC_P0_DREG(x)                       (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P0_DREG_SHIFT)) & CPE_PMC_P0_DREG_MASK)

#define CPE_PMC_P0_DPOL_MASK                     (0x80U)
#define CPE_PMC_P0_DPOL_SHIFT                    (7U)
#define CPE_PMC_P0_DPOL_WIDTH                    (1U)
#define CPE_PMC_P0_DPOL(x)                       (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P0_DPOL_SHIFT)) & CPE_PMC_P0_DPOL_MASK)

#define CPE_PMC_P0_UA_MASK                       (0x100U)
#define CPE_PMC_P0_UA_SHIFT                      (8U)
#define CPE_PMC_P0_UA_WIDTH                      (1U)
#define CPE_PMC_P0_UA(x)                         (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P0_UA_SHIFT)) & CPE_PMC_P0_UA_MASK)

#define CPE_PMC_P0_AO_MASK                       (0x200U)
#define CPE_PMC_P0_AO_SHIFT                      (9U)
#define CPE_PMC_P0_AO_WIDTH                      (1U)
#define CPE_PMC_P0_AO(x)                         (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P0_AO_SHIFT)) & CPE_PMC_P0_AO_MASK)
/*! @} */

/*! @name P1 - Program Register 1 */
/*! @{ */

#define CPE_PMC_P1_OP_MASK                       (0x3U)
#define CPE_PMC_P1_OP_SHIFT                      (0U)
#define CPE_PMC_P1_OP_WIDTH                      (2U)
#define CPE_PMC_P1_OP(x)                         (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P1_OP_SHIFT)) & CPE_PMC_P1_OP_MASK)

#define CPE_PMC_P1_TRANS_MASK                    (0x30U)
#define CPE_PMC_P1_TRANS_SHIFT                   (4U)
#define CPE_PMC_P1_TRANS_WIDTH                   (2U)
#define CPE_PMC_P1_TRANS(x)                      (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P1_TRANS_SHIFT)) & CPE_PMC_P1_TRANS_MASK)

#define CPE_PMC_P1_DREG_MASK                     (0x40U)
#define CPE_PMC_P1_DREG_SHIFT                    (6U)
#define CPE_PMC_P1_DREG_WIDTH                    (1U)
#define CPE_PMC_P1_DREG(x)                       (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P1_DREG_SHIFT)) & CPE_PMC_P1_DREG_MASK)

#define CPE_PMC_P1_DPOL_MASK                     (0x80U)
#define CPE_PMC_P1_DPOL_SHIFT                    (7U)
#define CPE_PMC_P1_DPOL_WIDTH                    (1U)
#define CPE_PMC_P1_DPOL(x)                       (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P1_DPOL_SHIFT)) & CPE_PMC_P1_DPOL_MASK)

#define CPE_PMC_P1_UA_MASK                       (0x100U)
#define CPE_PMC_P1_UA_SHIFT                      (8U)
#define CPE_PMC_P1_UA_WIDTH                      (1U)
#define CPE_PMC_P1_UA(x)                         (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P1_UA_SHIFT)) & CPE_PMC_P1_UA_MASK)

#define CPE_PMC_P1_AO_MASK                       (0x200U)
#define CPE_PMC_P1_AO_SHIFT                      (9U)
#define CPE_PMC_P1_AO_WIDTH                      (1U)
#define CPE_PMC_P1_AO(x)                         (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P1_AO_SHIFT)) & CPE_PMC_P1_AO_MASK)
/*! @} */

