zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CPE_PMC.h
/*! @name P2 - Program Register 2 */
/*! @{ */

#define CPE_PMC_P2_OP_MASK                       (0x3U)
#define CPE_PMC_P2_OP_SHIFT                      (0U)
#define CPE_PMC_P2_OP_WIDTH                      (2U)
#define CPE_PMC_P2_OP(x)                         (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P2_OP_SHIFT)) & CPE_PMC_P2_OP_MASK)

#define CPE_PMC_P2_TRANS_MASK                    (0x30U)
#define CPE_PMC_P2_TRANS_SHIFT                   (4U)
#define CPE_PMC_P2_TRANS_WIDTH                   (2U)
#define CPE_PMC_P2_TRANS(x)                      (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P2_TRANS_SHIFT)) & CPE_PMC_P2_TRANS_MASK)

#define CPE_PMC_P2_DREG_MASK                     (0x40U)
#define CPE_PMC_P2_DREG_SHIFT                    (6U)
#define CPE_PMC_P2_DREG_WIDTH                    (1U)
#define CPE_PMC_P2_DREG(x)                       (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P2_DREG_SHIFT)) & CPE_PMC_P2_DREG_MASK)

#define CPE_PMC_P2_DPOL_MASK                     (0x80U)
#define CPE_PMC_P2_DPOL_SHIFT                    (7U)
#define CPE_PMC_P2_DPOL_WIDTH                    (1U)
#define CPE_PMC_P2_DPOL(x)                       (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P2_DPOL_SHIFT)) & CPE_PMC_P2_DPOL_MASK)

#define CPE_PMC_P2_UA_MASK                       (0x100U)
#define CPE_PMC_P2_UA_SHIFT                      (8U)
#define CPE_PMC_P2_UA_WIDTH                      (1U)
#define CPE_PMC_P2_UA(x)                         (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P2_UA_SHIFT)) & CPE_PMC_P2_UA_MASK)

#define CPE_PMC_P2_AO_MASK                       (0x200U)
#define CPE_PMC_P2_AO_SHIFT                      (9U)
#define CPE_PMC_P2_AO_WIDTH                      (1U)
#define CPE_PMC_P2_AO(x)                         (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P2_AO_SHIFT)) & CPE_PMC_P2_AO_MASK)
/*! @} */

/*! @name P3 - Program Register 3 */
/*! @{ */

#define CPE_PMC_P3_OP_MASK                       (0x3U)
#define CPE_PMC_P3_OP_SHIFT                      (0U)
#define CPE_PMC_P3_OP_WIDTH                      (2U)
#define CPE_PMC_P3_OP(x)                         (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P3_OP_SHIFT)) & CPE_PMC_P3_OP_MASK)

#define CPE_PMC_P3_TRANS_MASK                    (0x30U)
#define CPE_PMC_P3_TRANS_SHIFT                   (4U)
#define CPE_PMC_P3_TRANS_WIDTH                   (2U)
#define CPE_PMC_P3_TRANS(x)                      (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P3_TRANS_SHIFT)) & CPE_PMC_P3_TRANS_MASK)

#define CPE_PMC_P3_DREG_MASK                     (0x40U)
#define CPE_PMC_P3_DREG_SHIFT                    (6U)
#define CPE_PMC_P3_DREG_WIDTH                    (1U)
#define CPE_PMC_P3_DREG(x)                       (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P3_DREG_SHIFT)) & CPE_PMC_P3_DREG_MASK)

#define CPE_PMC_P3_DPOL_MASK                     (0x80U)
#define CPE_PMC_P3_DPOL_SHIFT                    (7U)
#define CPE_PMC_P3_DPOL_WIDTH                    (1U)
#define CPE_PMC_P3_DPOL(x)                       (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P3_DPOL_SHIFT)) & CPE_PMC_P3_DPOL_MASK)

#define CPE_PMC_P3_UA_MASK                       (0x100U)
#define CPE_PMC_P3_UA_SHIFT                      (8U)
#define CPE_PMC_P3_UA_WIDTH                      (1U)
#define CPE_PMC_P3_UA(x)                         (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P3_UA_SHIFT)) & CPE_PMC_P3_UA_MASK)

#define CPE_PMC_P3_AO_MASK                       (0x200U)
#define CPE_PMC_P3_AO_SHIFT                      (9U)
#define CPE_PMC_P3_AO_WIDTH                      (1U)
#define CPE_PMC_P3_AO(x)                         (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P3_AO_SHIFT)) & CPE_PMC_P3_AO_MASK)
/*! @} */

/*! @name P4 - Program Register 4 */
/*! @{ */

#define CPE_PMC_P4_OP_MASK                       (0x3U)
#define CPE_PMC_P4_OP_SHIFT                      (0U)
#define CPE_PMC_P4_OP_WIDTH                      (2U)
#define CPE_PMC_P4_OP(x)                         (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P4_OP_SHIFT)) & CPE_PMC_P4_OP_MASK)

#define CPE_PMC_P4_TRANS_MASK                    (0x30U)
#define CPE_PMC_P4_TRANS_SHIFT                   (4U)
#define CPE_PMC_P4_TRANS_WIDTH                   (2U)
#define CPE_PMC_P4_TRANS(x)                      (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P4_TRANS_SHIFT)) & CPE_PMC_P4_TRANS_MASK)

#define CPE_PMC_P4_DREG_MASK                     (0x40U)
#define CPE_PMC_P4_DREG_SHIFT                    (6U)
#define CPE_PMC_P4_DREG_WIDTH                    (1U)
#define CPE_PMC_P4_DREG(x)                       (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P4_DREG_SHIFT)) & CPE_PMC_P4_DREG_MASK)

#define CPE_PMC_P4_DPOL_MASK                     (0x80U)
#define CPE_PMC_P4_DPOL_SHIFT                    (7U)
#define CPE_PMC_P4_DPOL_WIDTH                    (1U)
#define CPE_PMC_P4_DPOL(x)                       (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P4_DPOL_SHIFT)) & CPE_PMC_P4_DPOL_MASK)

#define CPE_PMC_P4_UA_MASK                       (0x100U)
#define CPE_PMC_P4_UA_SHIFT                      (8U)
#define CPE_PMC_P4_UA_WIDTH                      (1U)
#define CPE_PMC_P4_UA(x)                         (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P4_UA_SHIFT)) & CPE_PMC_P4_UA_MASK)

#define CPE_PMC_P4_AO_MASK                       (0x200U)
#define CPE_PMC_P4_AO_SHIFT                      (9U)
#define CPE_PMC_P4_AO_WIDTH                      (1U)
#define CPE_PMC_P4_AO(x)                         (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P4_AO_SHIFT)) & CPE_PMC_P4_AO_MASK)
/*! @} */

/*! @name P5 - Program Register 5 */
/*! @{ */

#define CPE_PMC_P5_OP_MASK                       (0x3U)
#define CPE_PMC_P5_OP_SHIFT                      (0U)
#define CPE_PMC_P5_OP_WIDTH                      (2U)
#define CPE_PMC_P5_OP(x)                         (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P5_OP_SHIFT)) & CPE_PMC_P5_OP_MASK)

#define CPE_PMC_P5_TRANS_MASK                    (0x30U)
#define CPE_PMC_P5_TRANS_SHIFT                   (4U)
#define CPE_PMC_P5_TRANS_WIDTH                   (2U)
#define CPE_PMC_P5_TRANS(x)                      (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P5_TRANS_SHIFT)) & CPE_PMC_P5_TRANS_MASK)

