zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CPE_PMC.h
#define CPE_PMC_P5_DREG_MASK                     (0x40U)
#define CPE_PMC_P5_DREG_SHIFT                    (6U)
#define CPE_PMC_P5_DREG_WIDTH                    (1U)
#define CPE_PMC_P5_DREG(x)                       (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P5_DREG_SHIFT)) & CPE_PMC_P5_DREG_MASK)

#define CPE_PMC_P5_DPOL_MASK                     (0x80U)
#define CPE_PMC_P5_DPOL_SHIFT                    (7U)
#define CPE_PMC_P5_DPOL_WIDTH                    (1U)
#define CPE_PMC_P5_DPOL(x)                       (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P5_DPOL_SHIFT)) & CPE_PMC_P5_DPOL_MASK)

#define CPE_PMC_P5_UA_MASK                       (0x100U)
#define CPE_PMC_P5_UA_SHIFT                      (8U)
#define CPE_PMC_P5_UA_WIDTH                      (1U)
#define CPE_PMC_P5_UA(x)                         (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P5_UA_SHIFT)) & CPE_PMC_P5_UA_MASK)

#define CPE_PMC_P5_AO_MASK                       (0x200U)
#define CPE_PMC_P5_AO_SHIFT                      (9U)
#define CPE_PMC_P5_AO_WIDTH                      (1U)
#define CPE_PMC_P5_AO(x)                         (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P5_AO_SHIFT)) & CPE_PMC_P5_AO_MASK)
/*! @} */

/*! @name P6 - Program Register 6 */
/*! @{ */

#define CPE_PMC_P6_OP_MASK                       (0x3U)
#define CPE_PMC_P6_OP_SHIFT                      (0U)
#define CPE_PMC_P6_OP_WIDTH                      (2U)
#define CPE_PMC_P6_OP(x)                         (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P6_OP_SHIFT)) & CPE_PMC_P6_OP_MASK)

#define CPE_PMC_P6_TRANS_MASK                    (0x30U)
#define CPE_PMC_P6_TRANS_SHIFT                   (4U)
#define CPE_PMC_P6_TRANS_WIDTH                   (2U)
#define CPE_PMC_P6_TRANS(x)                      (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P6_TRANS_SHIFT)) & CPE_PMC_P6_TRANS_MASK)

#define CPE_PMC_P6_DREG_MASK                     (0x40U)
#define CPE_PMC_P6_DREG_SHIFT                    (6U)
#define CPE_PMC_P6_DREG_WIDTH                    (1U)
#define CPE_PMC_P6_DREG(x)                       (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P6_DREG_SHIFT)) & CPE_PMC_P6_DREG_MASK)

#define CPE_PMC_P6_DPOL_MASK                     (0x80U)
#define CPE_PMC_P6_DPOL_SHIFT                    (7U)
#define CPE_PMC_P6_DPOL_WIDTH                    (1U)
#define CPE_PMC_P6_DPOL(x)                       (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P6_DPOL_SHIFT)) & CPE_PMC_P6_DPOL_MASK)

#define CPE_PMC_P6_UA_MASK                       (0x100U)
#define CPE_PMC_P6_UA_SHIFT                      (8U)
#define CPE_PMC_P6_UA_WIDTH                      (1U)
#define CPE_PMC_P6_UA(x)                         (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P6_UA_SHIFT)) & CPE_PMC_P6_UA_MASK)

#define CPE_PMC_P6_AO_MASK                       (0x200U)
#define CPE_PMC_P6_AO_SHIFT                      (9U)
#define CPE_PMC_P6_AO_WIDTH                      (1U)
#define CPE_PMC_P6_AO(x)                         (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P6_AO_SHIFT)) & CPE_PMC_P6_AO_MASK)
/*! @} */

/*! @name P7 - Program Register 7 */
/*! @{ */

#define CPE_PMC_P7_OP_MASK                       (0x3U)
#define CPE_PMC_P7_OP_SHIFT                      (0U)
#define CPE_PMC_P7_OP_WIDTH                      (2U)
#define CPE_PMC_P7_OP(x)                         (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P7_OP_SHIFT)) & CPE_PMC_P7_OP_MASK)

#define CPE_PMC_P7_TRANS_MASK                    (0x30U)
#define CPE_PMC_P7_TRANS_SHIFT                   (4U)
#define CPE_PMC_P7_TRANS_WIDTH                   (2U)
#define CPE_PMC_P7_TRANS(x)                      (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P7_TRANS_SHIFT)) & CPE_PMC_P7_TRANS_MASK)

#define CPE_PMC_P7_DREG_MASK                     (0x40U)
#define CPE_PMC_P7_DREG_SHIFT                    (6U)
#define CPE_PMC_P7_DREG_WIDTH                    (1U)
#define CPE_PMC_P7_DREG(x)                       (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P7_DREG_SHIFT)) & CPE_PMC_P7_DREG_MASK)

#define CPE_PMC_P7_DPOL_MASK                     (0x80U)
#define CPE_PMC_P7_DPOL_SHIFT                    (7U)
#define CPE_PMC_P7_DPOL_WIDTH                    (1U)
#define CPE_PMC_P7_DPOL(x)                       (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P7_DPOL_SHIFT)) & CPE_PMC_P7_DPOL_MASK)

#define CPE_PMC_P7_UA_MASK                       (0x100U)
#define CPE_PMC_P7_UA_SHIFT                      (8U)
#define CPE_PMC_P7_UA_WIDTH                      (1U)
#define CPE_PMC_P7_UA(x)                         (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P7_UA_SHIFT)) & CPE_PMC_P7_UA_MASK)

#define CPE_PMC_P7_AO_MASK                       (0x200U)
#define CPE_PMC_P7_AO_SHIFT                      (9U)
#define CPE_PMC_P7_AO_WIDTH                      (1U)
#define CPE_PMC_P7_AO(x)                         (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P7_AO_SHIFT)) & CPE_PMC_P7_AO_MASK)
/*! @} */

/*! @name P8 - Program Register 8 */
/*! @{ */

#define CPE_PMC_P8_OP_MASK                       (0x3U)
#define CPE_PMC_P8_OP_SHIFT                      (0U)
#define CPE_PMC_P8_OP_WIDTH                      (2U)
#define CPE_PMC_P8_OP(x)                         (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P8_OP_SHIFT)) & CPE_PMC_P8_OP_MASK)

#define CPE_PMC_P8_TRANS_MASK                    (0x30U)
#define CPE_PMC_P8_TRANS_SHIFT                   (4U)
#define CPE_PMC_P8_TRANS_WIDTH                   (2U)
#define CPE_PMC_P8_TRANS(x)                      (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P8_TRANS_SHIFT)) & CPE_PMC_P8_TRANS_MASK)

#define CPE_PMC_P8_DREG_MASK                     (0x40U)
#define CPE_PMC_P8_DREG_SHIFT                    (6U)
#define CPE_PMC_P8_DREG_WIDTH                    (1U)
#define CPE_PMC_P8_DREG(x)                       (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P8_DREG_SHIFT)) & CPE_PMC_P8_DREG_MASK)

#define CPE_PMC_P8_DPOL_MASK                     (0x80U)
#define CPE_PMC_P8_DPOL_SHIFT                    (7U)
#define CPE_PMC_P8_DPOL_WIDTH                    (1U)
#define CPE_PMC_P8_DPOL(x)                       (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P8_DPOL_SHIFT)) & CPE_PMC_P8_DPOL_MASK)

#define CPE_PMC_P8_UA_MASK                       (0x100U)
#define CPE_PMC_P8_UA_SHIFT                      (8U)
#define CPE_PMC_P8_UA_WIDTH                      (1U)
#define CPE_PMC_P8_UA(x)                         (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P8_UA_SHIFT)) & CPE_PMC_P8_UA_MASK)

#define CPE_PMC_P8_AO_MASK                       (0x200U)
#define CPE_PMC_P8_AO_SHIFT                      (9U)
#define CPE_PMC_P8_AO_WIDTH                      (1U)
#define CPE_PMC_P8_AO(x)                         (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P8_AO_SHIFT)) & CPE_PMC_P8_AO_MASK)
/*! @} */

/*! @name P9 - Program Register 9 */
/*! @{ */

#define CPE_PMC_P9_OP_MASK                       (0x3U)
#define CPE_PMC_P9_OP_SHIFT                      (0U)
#define CPE_PMC_P9_OP_WIDTH                      (2U)
#define CPE_PMC_P9_OP(x)                         (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P9_OP_SHIFT)) & CPE_PMC_P9_OP_MASK)

