zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CPE_PMC.h
#define CPE_PMC_P9_TRANS_MASK                    (0x30U)
#define CPE_PMC_P9_TRANS_SHIFT                   (4U)
#define CPE_PMC_P9_TRANS_WIDTH                   (2U)
#define CPE_PMC_P9_TRANS(x)                      (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P9_TRANS_SHIFT)) & CPE_PMC_P9_TRANS_MASK)

#define CPE_PMC_P9_DREG_MASK                     (0x40U)
#define CPE_PMC_P9_DREG_SHIFT                    (6U)
#define CPE_PMC_P9_DREG_WIDTH                    (1U)
#define CPE_PMC_P9_DREG(x)                       (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P9_DREG_SHIFT)) & CPE_PMC_P9_DREG_MASK)

#define CPE_PMC_P9_DPOL_MASK                     (0x80U)
#define CPE_PMC_P9_DPOL_SHIFT                    (7U)
#define CPE_PMC_P9_DPOL_WIDTH                    (1U)
#define CPE_PMC_P9_DPOL(x)                       (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P9_DPOL_SHIFT)) & CPE_PMC_P9_DPOL_MASK)

#define CPE_PMC_P9_UA_MASK                       (0x100U)
#define CPE_PMC_P9_UA_SHIFT                      (8U)
#define CPE_PMC_P9_UA_WIDTH                      (1U)
#define CPE_PMC_P9_UA(x)                         (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P9_UA_SHIFT)) & CPE_PMC_P9_UA_MASK)

#define CPE_PMC_P9_AO_MASK                       (0x200U)
#define CPE_PMC_P9_AO_SHIFT                      (9U)
#define CPE_PMC_P9_AO_WIDTH                      (1U)
#define CPE_PMC_P9_AO(x)                         (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P9_AO_SHIFT)) & CPE_PMC_P9_AO_MASK)
/*! @} */

/*! @name P10 - Program Register 10 */
/*! @{ */

#define CPE_PMC_P10_OP_MASK                      (0x3U)
#define CPE_PMC_P10_OP_SHIFT                     (0U)
#define CPE_PMC_P10_OP_WIDTH                     (2U)
#define CPE_PMC_P10_OP(x)                        (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P10_OP_SHIFT)) & CPE_PMC_P10_OP_MASK)

#define CPE_PMC_P10_TRANS_MASK                   (0x30U)
#define CPE_PMC_P10_TRANS_SHIFT                  (4U)
#define CPE_PMC_P10_TRANS_WIDTH                  (2U)
#define CPE_PMC_P10_TRANS(x)                     (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P10_TRANS_SHIFT)) & CPE_PMC_P10_TRANS_MASK)

#define CPE_PMC_P10_DREG_MASK                    (0x40U)
#define CPE_PMC_P10_DREG_SHIFT                   (6U)
#define CPE_PMC_P10_DREG_WIDTH                   (1U)
#define CPE_PMC_P10_DREG(x)                      (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P10_DREG_SHIFT)) & CPE_PMC_P10_DREG_MASK)

#define CPE_PMC_P10_DPOL_MASK                    (0x80U)
#define CPE_PMC_P10_DPOL_SHIFT                   (7U)
#define CPE_PMC_P10_DPOL_WIDTH                   (1U)
#define CPE_PMC_P10_DPOL(x)                      (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P10_DPOL_SHIFT)) & CPE_PMC_P10_DPOL_MASK)

#define CPE_PMC_P10_UA_MASK                      (0x100U)
#define CPE_PMC_P10_UA_SHIFT                     (8U)
#define CPE_PMC_P10_UA_WIDTH                     (1U)
#define CPE_PMC_P10_UA(x)                        (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P10_UA_SHIFT)) & CPE_PMC_P10_UA_MASK)

#define CPE_PMC_P10_AO_MASK                      (0x200U)
#define CPE_PMC_P10_AO_SHIFT                     (9U)
#define CPE_PMC_P10_AO_WIDTH                     (1U)
#define CPE_PMC_P10_AO(x)                        (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P10_AO_SHIFT)) & CPE_PMC_P10_AO_MASK)
/*! @} */

/*! @name P11 - Program Register 11 */
/*! @{ */

#define CPE_PMC_P11_OP_MASK                      (0x3U)
#define CPE_PMC_P11_OP_SHIFT                     (0U)
#define CPE_PMC_P11_OP_WIDTH                     (2U)
#define CPE_PMC_P11_OP(x)                        (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P11_OP_SHIFT)) & CPE_PMC_P11_OP_MASK)

#define CPE_PMC_P11_TRANS_MASK                   (0x30U)
#define CPE_PMC_P11_TRANS_SHIFT                  (4U)
#define CPE_PMC_P11_TRANS_WIDTH                  (2U)
#define CPE_PMC_P11_TRANS(x)                     (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P11_TRANS_SHIFT)) & CPE_PMC_P11_TRANS_MASK)

#define CPE_PMC_P11_DREG_MASK                    (0x40U)
#define CPE_PMC_P11_DREG_SHIFT                   (6U)
#define CPE_PMC_P11_DREG_WIDTH                   (1U)
#define CPE_PMC_P11_DREG(x)                      (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P11_DREG_SHIFT)) & CPE_PMC_P11_DREG_MASK)

#define CPE_PMC_P11_DPOL_MASK                    (0x80U)
#define CPE_PMC_P11_DPOL_SHIFT                   (7U)
#define CPE_PMC_P11_DPOL_WIDTH                   (1U)
#define CPE_PMC_P11_DPOL(x)                      (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P11_DPOL_SHIFT)) & CPE_PMC_P11_DPOL_MASK)

#define CPE_PMC_P11_UA_MASK                      (0x100U)
#define CPE_PMC_P11_UA_SHIFT                     (8U)
#define CPE_PMC_P11_UA_WIDTH                     (1U)
#define CPE_PMC_P11_UA(x)                        (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P11_UA_SHIFT)) & CPE_PMC_P11_UA_MASK)

#define CPE_PMC_P11_AO_MASK                      (0x200U)
#define CPE_PMC_P11_AO_SHIFT                     (9U)
#define CPE_PMC_P11_AO_WIDTH                     (1U)
#define CPE_PMC_P11_AO(x)                        (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P11_AO_SHIFT)) & CPE_PMC_P11_AO_MASK)
/*! @} */

/*! @name P12 - Program Register 12 */
/*! @{ */

#define CPE_PMC_P12_OP_MASK                      (0x3U)
#define CPE_PMC_P12_OP_SHIFT                     (0U)
#define CPE_PMC_P12_OP_WIDTH                     (2U)
#define CPE_PMC_P12_OP(x)                        (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P12_OP_SHIFT)) & CPE_PMC_P12_OP_MASK)

#define CPE_PMC_P12_TRANS_MASK                   (0x30U)
#define CPE_PMC_P12_TRANS_SHIFT                  (4U)
#define CPE_PMC_P12_TRANS_WIDTH                  (2U)
#define CPE_PMC_P12_TRANS(x)                     (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P12_TRANS_SHIFT)) & CPE_PMC_P12_TRANS_MASK)

#define CPE_PMC_P12_DREG_MASK                    (0x40U)
#define CPE_PMC_P12_DREG_SHIFT                   (6U)
#define CPE_PMC_P12_DREG_WIDTH                   (1U)
#define CPE_PMC_P12_DREG(x)                      (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P12_DREG_SHIFT)) & CPE_PMC_P12_DREG_MASK)

