zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CPE_PMC.h
#define CPE_PMC_P12_DPOL_MASK                    (0x80U)
#define CPE_PMC_P12_DPOL_SHIFT                   (7U)
#define CPE_PMC_P12_DPOL_WIDTH                   (1U)
#define CPE_PMC_P12_DPOL(x)                      (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P12_DPOL_SHIFT)) & CPE_PMC_P12_DPOL_MASK)

#define CPE_PMC_P12_UA_MASK                      (0x100U)
#define CPE_PMC_P12_UA_SHIFT                     (8U)
#define CPE_PMC_P12_UA_WIDTH                     (1U)
#define CPE_PMC_P12_UA(x)                        (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P12_UA_SHIFT)) & CPE_PMC_P12_UA_MASK)

#define CPE_PMC_P12_AO_MASK                      (0x200U)
#define CPE_PMC_P12_AO_SHIFT                     (9U)
#define CPE_PMC_P12_AO_WIDTH                     (1U)
#define CPE_PMC_P12_AO(x)                        (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P12_AO_SHIFT)) & CPE_PMC_P12_AO_MASK)
/*! @} */

/*! @name P13 - Program Register 13 */
/*! @{ */

#define CPE_PMC_P13_OP_MASK                      (0x3U)
#define CPE_PMC_P13_OP_SHIFT                     (0U)
#define CPE_PMC_P13_OP_WIDTH                     (2U)
#define CPE_PMC_P13_OP(x)                        (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P13_OP_SHIFT)) & CPE_PMC_P13_OP_MASK)

#define CPE_PMC_P13_TRANS_MASK                   (0x30U)
#define CPE_PMC_P13_TRANS_SHIFT                  (4U)
#define CPE_PMC_P13_TRANS_WIDTH                  (2U)
#define CPE_PMC_P13_TRANS(x)                     (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P13_TRANS_SHIFT)) & CPE_PMC_P13_TRANS_MASK)

#define CPE_PMC_P13_DREG_MASK                    (0x40U)
#define CPE_PMC_P13_DREG_SHIFT                   (6U)
#define CPE_PMC_P13_DREG_WIDTH                   (1U)
#define CPE_PMC_P13_DREG(x)                      (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P13_DREG_SHIFT)) & CPE_PMC_P13_DREG_MASK)

#define CPE_PMC_P13_DPOL_MASK                    (0x80U)
#define CPE_PMC_P13_DPOL_SHIFT                   (7U)
#define CPE_PMC_P13_DPOL_WIDTH                   (1U)
#define CPE_PMC_P13_DPOL(x)                      (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P13_DPOL_SHIFT)) & CPE_PMC_P13_DPOL_MASK)

#define CPE_PMC_P13_UA_MASK                      (0x100U)
#define CPE_PMC_P13_UA_SHIFT                     (8U)
#define CPE_PMC_P13_UA_WIDTH                     (1U)
#define CPE_PMC_P13_UA(x)                        (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P13_UA_SHIFT)) & CPE_PMC_P13_UA_MASK)

#define CPE_PMC_P13_AO_MASK                      (0x200U)
#define CPE_PMC_P13_AO_SHIFT                     (9U)
#define CPE_PMC_P13_AO_WIDTH                     (1U)
#define CPE_PMC_P13_AO(x)                        (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P13_AO_SHIFT)) & CPE_PMC_P13_AO_MASK)
/*! @} */

/*! @name P14 - Program Register 14 */
/*! @{ */

#define CPE_PMC_P14_OP_MASK                      (0x3U)
#define CPE_PMC_P14_OP_SHIFT                     (0U)
#define CPE_PMC_P14_OP_WIDTH                     (2U)
#define CPE_PMC_P14_OP(x)                        (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P14_OP_SHIFT)) & CPE_PMC_P14_OP_MASK)

#define CPE_PMC_P14_TRANS_MASK                   (0x30U)
#define CPE_PMC_P14_TRANS_SHIFT                  (4U)
#define CPE_PMC_P14_TRANS_WIDTH                  (2U)
#define CPE_PMC_P14_TRANS(x)                     (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P14_TRANS_SHIFT)) & CPE_PMC_P14_TRANS_MASK)

#define CPE_PMC_P14_DREG_MASK                    (0x40U)
#define CPE_PMC_P14_DREG_SHIFT                   (6U)
#define CPE_PMC_P14_DREG_WIDTH                   (1U)
#define CPE_PMC_P14_DREG(x)                      (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P14_DREG_SHIFT)) & CPE_PMC_P14_DREG_MASK)

#define CPE_PMC_P14_DPOL_MASK                    (0x80U)
#define CPE_PMC_P14_DPOL_SHIFT                   (7U)
#define CPE_PMC_P14_DPOL_WIDTH                   (1U)
#define CPE_PMC_P14_DPOL(x)                      (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P14_DPOL_SHIFT)) & CPE_PMC_P14_DPOL_MASK)

#define CPE_PMC_P14_UA_MASK                      (0x100U)
#define CPE_PMC_P14_UA_SHIFT                     (8U)
#define CPE_PMC_P14_UA_WIDTH                     (1U)
#define CPE_PMC_P14_UA(x)                        (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P14_UA_SHIFT)) & CPE_PMC_P14_UA_MASK)

#define CPE_PMC_P14_AO_MASK                      (0x200U)
#define CPE_PMC_P14_AO_SHIFT                     (9U)
#define CPE_PMC_P14_AO_WIDTH                     (1U)
#define CPE_PMC_P14_AO(x)                        (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P14_AO_SHIFT)) & CPE_PMC_P14_AO_MASK)
/*! @} */

/*! @name P15 - Program Register 15 */
/*! @{ */

#define CPE_PMC_P15_OP_MASK                      (0x3U)
#define CPE_PMC_P15_OP_SHIFT                     (0U)
#define CPE_PMC_P15_OP_WIDTH                     (2U)
#define CPE_PMC_P15_OP(x)                        (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P15_OP_SHIFT)) & CPE_PMC_P15_OP_MASK)

#define CPE_PMC_P15_TRANS_MASK                   (0x30U)
#define CPE_PMC_P15_TRANS_SHIFT                  (4U)
#define CPE_PMC_P15_TRANS_WIDTH                  (2U)
#define CPE_PMC_P15_TRANS(x)                     (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P15_TRANS_SHIFT)) & CPE_PMC_P15_TRANS_MASK)

#define CPE_PMC_P15_DREG_MASK                    (0x40U)
#define CPE_PMC_P15_DREG_SHIFT                   (6U)
#define CPE_PMC_P15_DREG_WIDTH                   (1U)
#define CPE_PMC_P15_DREG(x)                      (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P15_DREG_SHIFT)) & CPE_PMC_P15_DREG_MASK)

#define CPE_PMC_P15_DPOL_MASK                    (0x80U)
#define CPE_PMC_P15_DPOL_SHIFT                   (7U)
#define CPE_PMC_P15_DPOL_WIDTH                   (1U)
#define CPE_PMC_P15_DPOL(x)                      (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P15_DPOL_SHIFT)) & CPE_PMC_P15_DPOL_MASK)

#define CPE_PMC_P15_UA_MASK                      (0x100U)
#define CPE_PMC_P15_UA_SHIFT                     (8U)
#define CPE_PMC_P15_UA_WIDTH                     (1U)
#define CPE_PMC_P15_UA(x)                        (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P15_UA_SHIFT)) & CPE_PMC_P15_UA_MASK)

#define CPE_PMC_P15_AO_MASK                      (0x200U)
#define CPE_PMC_P15_AO_SHIFT                     (9U)
#define CPE_PMC_P15_AO_WIDTH                     (1U)
#define CPE_PMC_P15_AO(x)                        (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P15_AO_SHIFT)) & CPE_PMC_P15_AO_MASK)
/*! @} */

/*! @name P16 - Program Register 16 */
/*! @{ */

#define CPE_PMC_P16_OP_MASK                      (0x3U)
#define CPE_PMC_P16_OP_SHIFT                     (0U)
#define CPE_PMC_P16_OP_WIDTH                     (2U)
#define CPE_PMC_P16_OP(x)                        (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P16_OP_SHIFT)) & CPE_PMC_P16_OP_MASK)

#define CPE_PMC_P16_TRANS_MASK                   (0x30U)
#define CPE_PMC_P16_TRANS_SHIFT                  (4U)
#define CPE_PMC_P16_TRANS_WIDTH                  (2U)
#define CPE_PMC_P16_TRANS(x)                     (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P16_TRANS_SHIFT)) & CPE_PMC_P16_TRANS_MASK)

#define CPE_PMC_P16_DREG_MASK                    (0x40U)
#define CPE_PMC_P16_DREG_SHIFT                   (6U)
#define CPE_PMC_P16_DREG_WIDTH                   (1U)
#define CPE_PMC_P16_DREG(x)                      (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P16_DREG_SHIFT)) & CPE_PMC_P16_DREG_MASK)

#define CPE_PMC_P16_DPOL_MASK                    (0x80U)
#define CPE_PMC_P16_DPOL_SHIFT                   (7U)
#define CPE_PMC_P16_DPOL_WIDTH                   (1U)
#define CPE_PMC_P16_DPOL(x)                      (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P16_DPOL_SHIFT)) & CPE_PMC_P16_DPOL_MASK)

#define CPE_PMC_P16_UA_MASK                      (0x100U)
#define CPE_PMC_P16_UA_SHIFT                     (8U)
#define CPE_PMC_P16_UA_WIDTH                     (1U)
#define CPE_PMC_P16_UA(x)                        (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P16_UA_SHIFT)) & CPE_PMC_P16_UA_MASK)

#define CPE_PMC_P16_AO_MASK                      (0x200U)
#define CPE_PMC_P16_AO_SHIFT                     (9U)
#define CPE_PMC_P16_AO_WIDTH                     (1U)
#define CPE_PMC_P16_AO(x)                        (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P16_AO_SHIFT)) & CPE_PMC_P16_AO_MASK)
/*! @} */

