zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CPE_PMC.h
/*! @name P17 - Program Register 17 */
/*! @{ */

#define CPE_PMC_P17_OP_MASK                      (0x3U)
#define CPE_PMC_P17_OP_SHIFT                     (0U)
#define CPE_PMC_P17_OP_WIDTH                     (2U)
#define CPE_PMC_P17_OP(x)                        (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P17_OP_SHIFT)) & CPE_PMC_P17_OP_MASK)

#define CPE_PMC_P17_TRANS_MASK                   (0x30U)
#define CPE_PMC_P17_TRANS_SHIFT                  (4U)
#define CPE_PMC_P17_TRANS_WIDTH                  (2U)
#define CPE_PMC_P17_TRANS(x)                     (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P17_TRANS_SHIFT)) & CPE_PMC_P17_TRANS_MASK)

#define CPE_PMC_P17_DREG_MASK                    (0x40U)
#define CPE_PMC_P17_DREG_SHIFT                   (6U)
#define CPE_PMC_P17_DREG_WIDTH                   (1U)
#define CPE_PMC_P17_DREG(x)                      (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P17_DREG_SHIFT)) & CPE_PMC_P17_DREG_MASK)

#define CPE_PMC_P17_DPOL_MASK                    (0x80U)
#define CPE_PMC_P17_DPOL_SHIFT                   (7U)
#define CPE_PMC_P17_DPOL_WIDTH                   (1U)
#define CPE_PMC_P17_DPOL(x)                      (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P17_DPOL_SHIFT)) & CPE_PMC_P17_DPOL_MASK)

#define CPE_PMC_P17_UA_MASK                      (0x100U)
#define CPE_PMC_P17_UA_SHIFT                     (8U)
#define CPE_PMC_P17_UA_WIDTH                     (1U)
#define CPE_PMC_P17_UA(x)                        (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P17_UA_SHIFT)) & CPE_PMC_P17_UA_MASK)

#define CPE_PMC_P17_AO_MASK                      (0x200U)
#define CPE_PMC_P17_AO_SHIFT                     (9U)
#define CPE_PMC_P17_AO_WIDTH                     (1U)
#define CPE_PMC_P17_AO(x)                        (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P17_AO_SHIFT)) & CPE_PMC_P17_AO_MASK)
/*! @} */

/*! @name P18 - Program Register 18 */
/*! @{ */

#define CPE_PMC_P18_OP_MASK                      (0x3U)
#define CPE_PMC_P18_OP_SHIFT                     (0U)
#define CPE_PMC_P18_OP_WIDTH                     (2U)
#define CPE_PMC_P18_OP(x)                        (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P18_OP_SHIFT)) & CPE_PMC_P18_OP_MASK)

#define CPE_PMC_P18_TRANS_MASK                   (0x30U)
#define CPE_PMC_P18_TRANS_SHIFT                  (4U)
#define CPE_PMC_P18_TRANS_WIDTH                  (2U)
#define CPE_PMC_P18_TRANS(x)                     (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P18_TRANS_SHIFT)) & CPE_PMC_P18_TRANS_MASK)

#define CPE_PMC_P18_DREG_MASK                    (0x40U)
#define CPE_PMC_P18_DREG_SHIFT                   (6U)
#define CPE_PMC_P18_DREG_WIDTH                   (1U)
#define CPE_PMC_P18_DREG(x)                      (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P18_DREG_SHIFT)) & CPE_PMC_P18_DREG_MASK)

#define CPE_PMC_P18_DPOL_MASK                    (0x80U)
#define CPE_PMC_P18_DPOL_SHIFT                   (7U)
#define CPE_PMC_P18_DPOL_WIDTH                   (1U)
#define CPE_PMC_P18_DPOL(x)                      (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P18_DPOL_SHIFT)) & CPE_PMC_P18_DPOL_MASK)

#define CPE_PMC_P18_UA_MASK                      (0x100U)
#define CPE_PMC_P18_UA_SHIFT                     (8U)
#define CPE_PMC_P18_UA_WIDTH                     (1U)
#define CPE_PMC_P18_UA(x)                        (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P18_UA_SHIFT)) & CPE_PMC_P18_UA_MASK)

#define CPE_PMC_P18_AO_MASK                      (0x200U)
#define CPE_PMC_P18_AO_SHIFT                     (9U)
#define CPE_PMC_P18_AO_WIDTH                     (1U)
#define CPE_PMC_P18_AO(x)                        (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P18_AO_SHIFT)) & CPE_PMC_P18_AO_MASK)
/*! @} */

/*! @name P19 - Program Register 19 */
/*! @{ */

#define CPE_PMC_P19_OP_MASK                      (0x3U)
#define CPE_PMC_P19_OP_SHIFT                     (0U)
#define CPE_PMC_P19_OP_WIDTH                     (2U)
#define CPE_PMC_P19_OP(x)                        (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P19_OP_SHIFT)) & CPE_PMC_P19_OP_MASK)

#define CPE_PMC_P19_TRANS_MASK                   (0x30U)
#define CPE_PMC_P19_TRANS_SHIFT                  (4U)
#define CPE_PMC_P19_TRANS_WIDTH                  (2U)
#define CPE_PMC_P19_TRANS(x)                     (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P19_TRANS_SHIFT)) & CPE_PMC_P19_TRANS_MASK)

#define CPE_PMC_P19_DREG_MASK                    (0x40U)
#define CPE_PMC_P19_DREG_SHIFT                   (6U)
#define CPE_PMC_P19_DREG_WIDTH                   (1U)
#define CPE_PMC_P19_DREG(x)                      (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P19_DREG_SHIFT)) & CPE_PMC_P19_DREG_MASK)

#define CPE_PMC_P19_DPOL_MASK                    (0x80U)
#define CPE_PMC_P19_DPOL_SHIFT                   (7U)
#define CPE_PMC_P19_DPOL_WIDTH                   (1U)
#define CPE_PMC_P19_DPOL(x)                      (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P19_DPOL_SHIFT)) & CPE_PMC_P19_DPOL_MASK)

#define CPE_PMC_P19_UA_MASK                      (0x100U)
#define CPE_PMC_P19_UA_SHIFT                     (8U)
#define CPE_PMC_P19_UA_WIDTH                     (1U)
#define CPE_PMC_P19_UA(x)                        (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P19_UA_SHIFT)) & CPE_PMC_P19_UA_MASK)

#define CPE_PMC_P19_AO_MASK                      (0x200U)
#define CPE_PMC_P19_AO_SHIFT                     (9U)
#define CPE_PMC_P19_AO_WIDTH                     (1U)
#define CPE_PMC_P19_AO(x)                        (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P19_AO_SHIFT)) & CPE_PMC_P19_AO_MASK)
/*! @} */

/*! @name P20 - Program Register 20 */
/*! @{ */

#define CPE_PMC_P20_OP_MASK                      (0x3U)
#define CPE_PMC_P20_OP_SHIFT                     (0U)
#define CPE_PMC_P20_OP_WIDTH                     (2U)
#define CPE_PMC_P20_OP(x)                        (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P20_OP_SHIFT)) & CPE_PMC_P20_OP_MASK)

#define CPE_PMC_P20_TRANS_MASK                   (0x30U)
#define CPE_PMC_P20_TRANS_SHIFT                  (4U)
#define CPE_PMC_P20_TRANS_WIDTH                  (2U)
#define CPE_PMC_P20_TRANS(x)                     (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P20_TRANS_SHIFT)) & CPE_PMC_P20_TRANS_MASK)

#define CPE_PMC_P20_DREG_MASK                    (0x40U)
#define CPE_PMC_P20_DREG_SHIFT                   (6U)
#define CPE_PMC_P20_DREG_WIDTH                   (1U)
#define CPE_PMC_P20_DREG(x)                      (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P20_DREG_SHIFT)) & CPE_PMC_P20_DREG_MASK)

#define CPE_PMC_P20_DPOL_MASK                    (0x80U)
#define CPE_PMC_P20_DPOL_SHIFT                   (7U)
#define CPE_PMC_P20_DPOL_WIDTH                   (1U)
#define CPE_PMC_P20_DPOL(x)                      (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P20_DPOL_SHIFT)) & CPE_PMC_P20_DPOL_MASK)

#define CPE_PMC_P20_UA_MASK                      (0x100U)
#define CPE_PMC_P20_UA_SHIFT                     (8U)
#define CPE_PMC_P20_UA_WIDTH                     (1U)
#define CPE_PMC_P20_UA(x)                        (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P20_UA_SHIFT)) & CPE_PMC_P20_UA_MASK)

#define CPE_PMC_P20_AO_MASK                      (0x200U)
#define CPE_PMC_P20_AO_SHIFT                     (9U)
#define CPE_PMC_P20_AO_WIDTH                     (1U)
#define CPE_PMC_P20_AO(x)                        (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P20_AO_SHIFT)) & CPE_PMC_P20_AO_MASK)
/*! @} */

/*! @name P21 - Program Register 21 */
/*! @{ */

#define CPE_PMC_P21_OP_MASK                      (0x3U)
#define CPE_PMC_P21_OP_SHIFT                     (0U)
#define CPE_PMC_P21_OP_WIDTH                     (2U)
#define CPE_PMC_P21_OP(x)                        (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P21_OP_SHIFT)) & CPE_PMC_P21_OP_MASK)

#define CPE_PMC_P21_TRANS_MASK                   (0x30U)
#define CPE_PMC_P21_TRANS_SHIFT                  (4U)
#define CPE_PMC_P21_TRANS_WIDTH                  (2U)
#define CPE_PMC_P21_TRANS(x)                     (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P21_TRANS_SHIFT)) & CPE_PMC_P21_TRANS_MASK)

