zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CPE_PMC.h
#define CPE_PMC_P21_DREG_MASK                    (0x40U)
#define CPE_PMC_P21_DREG_SHIFT                   (6U)
#define CPE_PMC_P21_DREG_WIDTH                   (1U)
#define CPE_PMC_P21_DREG(x)                      (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P21_DREG_SHIFT)) & CPE_PMC_P21_DREG_MASK)

#define CPE_PMC_P21_DPOL_MASK                    (0x80U)
#define CPE_PMC_P21_DPOL_SHIFT                   (7U)
#define CPE_PMC_P21_DPOL_WIDTH                   (1U)
#define CPE_PMC_P21_DPOL(x)                      (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P21_DPOL_SHIFT)) & CPE_PMC_P21_DPOL_MASK)

#define CPE_PMC_P21_UA_MASK                      (0x100U)
#define CPE_PMC_P21_UA_SHIFT                     (8U)
#define CPE_PMC_P21_UA_WIDTH                     (1U)
#define CPE_PMC_P21_UA(x)                        (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P21_UA_SHIFT)) & CPE_PMC_P21_UA_MASK)

#define CPE_PMC_P21_AO_MASK                      (0x200U)
#define CPE_PMC_P21_AO_SHIFT                     (9U)
#define CPE_PMC_P21_AO_WIDTH                     (1U)
#define CPE_PMC_P21_AO(x)                        (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P21_AO_SHIFT)) & CPE_PMC_P21_AO_MASK)
/*! @} */

/*! @name P22 - Program Register 22 */
/*! @{ */

#define CPE_PMC_P22_OP_MASK                      (0x3U)
#define CPE_PMC_P22_OP_SHIFT                     (0U)
#define CPE_PMC_P22_OP_WIDTH                     (2U)
#define CPE_PMC_P22_OP(x)                        (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P22_OP_SHIFT)) & CPE_PMC_P22_OP_MASK)

#define CPE_PMC_P22_TRANS_MASK                   (0x30U)
#define CPE_PMC_P22_TRANS_SHIFT                  (4U)
#define CPE_PMC_P22_TRANS_WIDTH                  (2U)
#define CPE_PMC_P22_TRANS(x)                     (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P22_TRANS_SHIFT)) & CPE_PMC_P22_TRANS_MASK)

#define CPE_PMC_P22_DREG_MASK                    (0x40U)
#define CPE_PMC_P22_DREG_SHIFT                   (6U)
#define CPE_PMC_P22_DREG_WIDTH                   (1U)
#define CPE_PMC_P22_DREG(x)                      (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P22_DREG_SHIFT)) & CPE_PMC_P22_DREG_MASK)

#define CPE_PMC_P22_DPOL_MASK                    (0x80U)
#define CPE_PMC_P22_DPOL_SHIFT                   (7U)
#define CPE_PMC_P22_DPOL_WIDTH                   (1U)
#define CPE_PMC_P22_DPOL(x)                      (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P22_DPOL_SHIFT)) & CPE_PMC_P22_DPOL_MASK)

#define CPE_PMC_P22_UA_MASK                      (0x100U)
#define CPE_PMC_P22_UA_SHIFT                     (8U)
#define CPE_PMC_P22_UA_WIDTH                     (1U)
#define CPE_PMC_P22_UA(x)                        (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P22_UA_SHIFT)) & CPE_PMC_P22_UA_MASK)

#define CPE_PMC_P22_AO_MASK                      (0x200U)
#define CPE_PMC_P22_AO_SHIFT                     (9U)
#define CPE_PMC_P22_AO_WIDTH                     (1U)
#define CPE_PMC_P22_AO(x)                        (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P22_AO_SHIFT)) & CPE_PMC_P22_AO_MASK)
/*! @} */

/*! @name P23 - Program Register 23 */
/*! @{ */

#define CPE_PMC_P23_OP_MASK                      (0x3U)
#define CPE_PMC_P23_OP_SHIFT                     (0U)
#define CPE_PMC_P23_OP_WIDTH                     (2U)
#define CPE_PMC_P23_OP(x)                        (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P23_OP_SHIFT)) & CPE_PMC_P23_OP_MASK)

#define CPE_PMC_P23_TRANS_MASK                   (0x30U)
#define CPE_PMC_P23_TRANS_SHIFT                  (4U)
#define CPE_PMC_P23_TRANS_WIDTH                  (2U)
#define CPE_PMC_P23_TRANS(x)                     (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P23_TRANS_SHIFT)) & CPE_PMC_P23_TRANS_MASK)

#define CPE_PMC_P23_DREG_MASK                    (0x40U)
#define CPE_PMC_P23_DREG_SHIFT                   (6U)
#define CPE_PMC_P23_DREG_WIDTH                   (1U)
#define CPE_PMC_P23_DREG(x)                      (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P23_DREG_SHIFT)) & CPE_PMC_P23_DREG_MASK)

#define CPE_PMC_P23_DPOL_MASK                    (0x80U)
#define CPE_PMC_P23_DPOL_SHIFT                   (7U)
#define CPE_PMC_P23_DPOL_WIDTH                   (1U)
#define CPE_PMC_P23_DPOL(x)                      (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P23_DPOL_SHIFT)) & CPE_PMC_P23_DPOL_MASK)

#define CPE_PMC_P23_UA_MASK                      (0x100U)
#define CPE_PMC_P23_UA_SHIFT                     (8U)
#define CPE_PMC_P23_UA_WIDTH                     (1U)
#define CPE_PMC_P23_UA(x)                        (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P23_UA_SHIFT)) & CPE_PMC_P23_UA_MASK)

#define CPE_PMC_P23_AO_MASK                      (0x200U)
#define CPE_PMC_P23_AO_SHIFT                     (9U)
#define CPE_PMC_P23_AO_WIDTH                     (1U)
#define CPE_PMC_P23_AO(x)                        (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P23_AO_SHIFT)) & CPE_PMC_P23_AO_MASK)
/*! @} */

/*! @name P24 - Program Register 24 */
/*! @{ */

#define CPE_PMC_P24_OP_MASK                      (0x3U)
#define CPE_PMC_P24_OP_SHIFT                     (0U)
#define CPE_PMC_P24_OP_WIDTH                     (2U)
#define CPE_PMC_P24_OP(x)                        (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P24_OP_SHIFT)) & CPE_PMC_P24_OP_MASK)

#define CPE_PMC_P24_TRANS_MASK                   (0x30U)
#define CPE_PMC_P24_TRANS_SHIFT                  (4U)
#define CPE_PMC_P24_TRANS_WIDTH                  (2U)
#define CPE_PMC_P24_TRANS(x)                     (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P24_TRANS_SHIFT)) & CPE_PMC_P24_TRANS_MASK)

#define CPE_PMC_P24_DREG_MASK                    (0x40U)
#define CPE_PMC_P24_DREG_SHIFT                   (6U)
#define CPE_PMC_P24_DREG_WIDTH                   (1U)
#define CPE_PMC_P24_DREG(x)                      (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P24_DREG_SHIFT)) & CPE_PMC_P24_DREG_MASK)

#define CPE_PMC_P24_DPOL_MASK                    (0x80U)
#define CPE_PMC_P24_DPOL_SHIFT                   (7U)
#define CPE_PMC_P24_DPOL_WIDTH                   (1U)
#define CPE_PMC_P24_DPOL(x)                      (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P24_DPOL_SHIFT)) & CPE_PMC_P24_DPOL_MASK)

