zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CPE_PMC.h
#define CPE_PMC_P24_UA_MASK                      (0x100U)
#define CPE_PMC_P24_UA_SHIFT                     (8U)
#define CPE_PMC_P24_UA_WIDTH                     (1U)
#define CPE_PMC_P24_UA(x)                        (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P24_UA_SHIFT)) & CPE_PMC_P24_UA_MASK)

#define CPE_PMC_P24_AO_MASK                      (0x200U)
#define CPE_PMC_P24_AO_SHIFT                     (9U)
#define CPE_PMC_P24_AO_WIDTH                     (1U)
#define CPE_PMC_P24_AO(x)                        (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P24_AO_SHIFT)) & CPE_PMC_P24_AO_MASK)
/*! @} */

/*! @name P25 - Program Register 25 */
/*! @{ */

#define CPE_PMC_P25_OP_MASK                      (0x3U)
#define CPE_PMC_P25_OP_SHIFT                     (0U)
#define CPE_PMC_P25_OP_WIDTH                     (2U)
#define CPE_PMC_P25_OP(x)                        (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P25_OP_SHIFT)) & CPE_PMC_P25_OP_MASK)

#define CPE_PMC_P25_TRANS_MASK                   (0x30U)
#define CPE_PMC_P25_TRANS_SHIFT                  (4U)
#define CPE_PMC_P25_TRANS_WIDTH                  (2U)
#define CPE_PMC_P25_TRANS(x)                     (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P25_TRANS_SHIFT)) & CPE_PMC_P25_TRANS_MASK)

#define CPE_PMC_P25_DREG_MASK                    (0x40U)
#define CPE_PMC_P25_DREG_SHIFT                   (6U)
#define CPE_PMC_P25_DREG_WIDTH                   (1U)
#define CPE_PMC_P25_DREG(x)                      (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P25_DREG_SHIFT)) & CPE_PMC_P25_DREG_MASK)

#define CPE_PMC_P25_DPOL_MASK                    (0x80U)
#define CPE_PMC_P25_DPOL_SHIFT                   (7U)
#define CPE_PMC_P25_DPOL_WIDTH                   (1U)
#define CPE_PMC_P25_DPOL(x)                      (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P25_DPOL_SHIFT)) & CPE_PMC_P25_DPOL_MASK)

#define CPE_PMC_P25_UA_MASK                      (0x100U)
#define CPE_PMC_P25_UA_SHIFT                     (8U)
#define CPE_PMC_P25_UA_WIDTH                     (1U)
#define CPE_PMC_P25_UA(x)                        (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P25_UA_SHIFT)) & CPE_PMC_P25_UA_MASK)

#define CPE_PMC_P25_AO_MASK                      (0x200U)
#define CPE_PMC_P25_AO_SHIFT                     (9U)
#define CPE_PMC_P25_AO_WIDTH                     (1U)
#define CPE_PMC_P25_AO(x)                        (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P25_AO_SHIFT)) & CPE_PMC_P25_AO_MASK)
/*! @} */

/*! @name P26 - Program Register 26 */
/*! @{ */

#define CPE_PMC_P26_OP_MASK                      (0x3U)
#define CPE_PMC_P26_OP_SHIFT                     (0U)
#define CPE_PMC_P26_OP_WIDTH                     (2U)
#define CPE_PMC_P26_OP(x)                        (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P26_OP_SHIFT)) & CPE_PMC_P26_OP_MASK)

#define CPE_PMC_P26_TRANS_MASK                   (0x30U)
#define CPE_PMC_P26_TRANS_SHIFT                  (4U)
#define CPE_PMC_P26_TRANS_WIDTH                  (2U)
#define CPE_PMC_P26_TRANS(x)                     (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P26_TRANS_SHIFT)) & CPE_PMC_P26_TRANS_MASK)

#define CPE_PMC_P26_DREG_MASK                    (0x40U)
#define CPE_PMC_P26_DREG_SHIFT                   (6U)
#define CPE_PMC_P26_DREG_WIDTH                   (1U)
#define CPE_PMC_P26_DREG(x)                      (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P26_DREG_SHIFT)) & CPE_PMC_P26_DREG_MASK)

#define CPE_PMC_P26_DPOL_MASK                    (0x80U)
#define CPE_PMC_P26_DPOL_SHIFT                   (7U)
#define CPE_PMC_P26_DPOL_WIDTH                   (1U)
#define CPE_PMC_P26_DPOL(x)                      (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P26_DPOL_SHIFT)) & CPE_PMC_P26_DPOL_MASK)

#define CPE_PMC_P26_UA_MASK                      (0x100U)
#define CPE_PMC_P26_UA_SHIFT                     (8U)
#define CPE_PMC_P26_UA_WIDTH                     (1U)
#define CPE_PMC_P26_UA(x)                        (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P26_UA_SHIFT)) & CPE_PMC_P26_UA_MASK)

#define CPE_PMC_P26_AO_MASK                      (0x200U)
#define CPE_PMC_P26_AO_SHIFT                     (9U)
#define CPE_PMC_P26_AO_WIDTH                     (1U)
#define CPE_PMC_P26_AO(x)                        (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P26_AO_SHIFT)) & CPE_PMC_P26_AO_MASK)
/*! @} */

/*! @name P27 - Program Register 27 */
/*! @{ */

#define CPE_PMC_P27_OP_MASK                      (0x3U)
#define CPE_PMC_P27_OP_SHIFT                     (0U)
#define CPE_PMC_P27_OP_WIDTH                     (2U)
#define CPE_PMC_P27_OP(x)                        (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P27_OP_SHIFT)) & CPE_PMC_P27_OP_MASK)

#define CPE_PMC_P27_TRANS_MASK                   (0x30U)
#define CPE_PMC_P27_TRANS_SHIFT                  (4U)
#define CPE_PMC_P27_TRANS_WIDTH                  (2U)
#define CPE_PMC_P27_TRANS(x)                     (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P27_TRANS_SHIFT)) & CPE_PMC_P27_TRANS_MASK)

#define CPE_PMC_P27_DREG_MASK                    (0x40U)
#define CPE_PMC_P27_DREG_SHIFT                   (6U)
#define CPE_PMC_P27_DREG_WIDTH                   (1U)
#define CPE_PMC_P27_DREG(x)                      (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P27_DREG_SHIFT)) & CPE_PMC_P27_DREG_MASK)

#define CPE_PMC_P27_DPOL_MASK                    (0x80U)
#define CPE_PMC_P27_DPOL_SHIFT                   (7U)
#define CPE_PMC_P27_DPOL_WIDTH                   (1U)
#define CPE_PMC_P27_DPOL(x)                      (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P27_DPOL_SHIFT)) & CPE_PMC_P27_DPOL_MASK)

#define CPE_PMC_P27_UA_MASK                      (0x100U)
#define CPE_PMC_P27_UA_SHIFT                     (8U)
#define CPE_PMC_P27_UA_WIDTH                     (1U)
#define CPE_PMC_P27_UA(x)                        (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P27_UA_SHIFT)) & CPE_PMC_P27_UA_MASK)

#define CPE_PMC_P27_AO_MASK                      (0x200U)
#define CPE_PMC_P27_AO_SHIFT                     (9U)
#define CPE_PMC_P27_AO_WIDTH                     (1U)
#define CPE_PMC_P27_AO(x)                        (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P27_AO_SHIFT)) & CPE_PMC_P27_AO_MASK)
/*! @} */

/*! @name P28 - Program Register 28 */
/*! @{ */

