zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CPE_PMC.h
#define CPE_PMC_P28_OP_MASK                      (0x3U)
#define CPE_PMC_P28_OP_SHIFT                     (0U)
#define CPE_PMC_P28_OP_WIDTH                     (2U)
#define CPE_PMC_P28_OP(x)                        (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P28_OP_SHIFT)) & CPE_PMC_P28_OP_MASK)

#define CPE_PMC_P28_TRANS_MASK                   (0x30U)
#define CPE_PMC_P28_TRANS_SHIFT                  (4U)
#define CPE_PMC_P28_TRANS_WIDTH                  (2U)
#define CPE_PMC_P28_TRANS(x)                     (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P28_TRANS_SHIFT)) & CPE_PMC_P28_TRANS_MASK)

#define CPE_PMC_P28_DREG_MASK                    (0x40U)
#define CPE_PMC_P28_DREG_SHIFT                   (6U)
#define CPE_PMC_P28_DREG_WIDTH                   (1U)
#define CPE_PMC_P28_DREG(x)                      (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P28_DREG_SHIFT)) & CPE_PMC_P28_DREG_MASK)

#define CPE_PMC_P28_DPOL_MASK                    (0x80U)
#define CPE_PMC_P28_DPOL_SHIFT                   (7U)
#define CPE_PMC_P28_DPOL_WIDTH                   (1U)
#define CPE_PMC_P28_DPOL(x)                      (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P28_DPOL_SHIFT)) & CPE_PMC_P28_DPOL_MASK)

#define CPE_PMC_P28_UA_MASK                      (0x100U)
#define CPE_PMC_P28_UA_SHIFT                     (8U)
#define CPE_PMC_P28_UA_WIDTH                     (1U)
#define CPE_PMC_P28_UA(x)                        (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P28_UA_SHIFT)) & CPE_PMC_P28_UA_MASK)

#define CPE_PMC_P28_AO_MASK                      (0x200U)
#define CPE_PMC_P28_AO_SHIFT                     (9U)
#define CPE_PMC_P28_AO_WIDTH                     (1U)
#define CPE_PMC_P28_AO(x)                        (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P28_AO_SHIFT)) & CPE_PMC_P28_AO_MASK)
/*! @} */

/*! @name P29 - Program Register 29 */
/*! @{ */

#define CPE_PMC_P29_OP_MASK                      (0x3U)
#define CPE_PMC_P29_OP_SHIFT                     (0U)
#define CPE_PMC_P29_OP_WIDTH                     (2U)
#define CPE_PMC_P29_OP(x)                        (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P29_OP_SHIFT)) & CPE_PMC_P29_OP_MASK)

#define CPE_PMC_P29_TRANS_MASK                   (0x30U)
#define CPE_PMC_P29_TRANS_SHIFT                  (4U)
#define CPE_PMC_P29_TRANS_WIDTH                  (2U)
#define CPE_PMC_P29_TRANS(x)                     (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P29_TRANS_SHIFT)) & CPE_PMC_P29_TRANS_MASK)

#define CPE_PMC_P29_DREG_MASK                    (0x40U)
#define CPE_PMC_P29_DREG_SHIFT                   (6U)
#define CPE_PMC_P29_DREG_WIDTH                   (1U)
#define CPE_PMC_P29_DREG(x)                      (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P29_DREG_SHIFT)) & CPE_PMC_P29_DREG_MASK)

#define CPE_PMC_P29_DPOL_MASK                    (0x80U)
#define CPE_PMC_P29_DPOL_SHIFT                   (7U)
#define CPE_PMC_P29_DPOL_WIDTH                   (1U)
#define CPE_PMC_P29_DPOL(x)                      (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P29_DPOL_SHIFT)) & CPE_PMC_P29_DPOL_MASK)

#define CPE_PMC_P29_UA_MASK                      (0x100U)
#define CPE_PMC_P29_UA_SHIFT                     (8U)
#define CPE_PMC_P29_UA_WIDTH                     (1U)
#define CPE_PMC_P29_UA(x)                        (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P29_UA_SHIFT)) & CPE_PMC_P29_UA_MASK)

#define CPE_PMC_P29_AO_MASK                      (0x200U)
#define CPE_PMC_P29_AO_SHIFT                     (9U)
#define CPE_PMC_P29_AO_WIDTH                     (1U)
#define CPE_PMC_P29_AO(x)                        (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P29_AO_SHIFT)) & CPE_PMC_P29_AO_MASK)
/*! @} */

/*! @name P30 - Program Register 30 */
/*! @{ */

#define CPE_PMC_P30_OP_MASK                      (0x3U)
#define CPE_PMC_P30_OP_SHIFT                     (0U)
#define CPE_PMC_P30_OP_WIDTH                     (2U)
#define CPE_PMC_P30_OP(x)                        (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P30_OP_SHIFT)) & CPE_PMC_P30_OP_MASK)

#define CPE_PMC_P30_TRANS_MASK                   (0x30U)
#define CPE_PMC_P30_TRANS_SHIFT                  (4U)
#define CPE_PMC_P30_TRANS_WIDTH                  (2U)
#define CPE_PMC_P30_TRANS(x)                     (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P30_TRANS_SHIFT)) & CPE_PMC_P30_TRANS_MASK)

#define CPE_PMC_P30_DREG_MASK                    (0x40U)
#define CPE_PMC_P30_DREG_SHIFT                   (6U)
#define CPE_PMC_P30_DREG_WIDTH                   (1U)
#define CPE_PMC_P30_DREG(x)                      (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P30_DREG_SHIFT)) & CPE_PMC_P30_DREG_MASK)

#define CPE_PMC_P30_DPOL_MASK                    (0x80U)
#define CPE_PMC_P30_DPOL_SHIFT                   (7U)
#define CPE_PMC_P30_DPOL_WIDTH                   (1U)
#define CPE_PMC_P30_DPOL(x)                      (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P30_DPOL_SHIFT)) & CPE_PMC_P30_DPOL_MASK)

#define CPE_PMC_P30_UA_MASK                      (0x100U)
#define CPE_PMC_P30_UA_SHIFT                     (8U)
#define CPE_PMC_P30_UA_WIDTH                     (1U)
#define CPE_PMC_P30_UA(x)                        (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P30_UA_SHIFT)) & CPE_PMC_P30_UA_MASK)

#define CPE_PMC_P30_AO_MASK                      (0x200U)
#define CPE_PMC_P30_AO_SHIFT                     (9U)
#define CPE_PMC_P30_AO_WIDTH                     (1U)
#define CPE_PMC_P30_AO(x)                        (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P30_AO_SHIFT)) & CPE_PMC_P30_AO_MASK)
/*! @} */

/*! @name P31 - Program Register 31 */
/*! @{ */

#define CPE_PMC_P31_OP_MASK                      (0x3U)
#define CPE_PMC_P31_OP_SHIFT                     (0U)
#define CPE_PMC_P31_OP_WIDTH                     (2U)
#define CPE_PMC_P31_OP(x)                        (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P31_OP_SHIFT)) & CPE_PMC_P31_OP_MASK)

#define CPE_PMC_P31_TRANS_MASK                   (0x30U)
#define CPE_PMC_P31_TRANS_SHIFT                  (4U)
#define CPE_PMC_P31_TRANS_WIDTH                  (2U)
#define CPE_PMC_P31_TRANS(x)                     (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P31_TRANS_SHIFT)) & CPE_PMC_P31_TRANS_MASK)

#define CPE_PMC_P31_DREG_MASK                    (0x40U)
#define CPE_PMC_P31_DREG_SHIFT                   (6U)
#define CPE_PMC_P31_DREG_WIDTH                   (1U)
#define CPE_PMC_P31_DREG(x)                      (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P31_DREG_SHIFT)) & CPE_PMC_P31_DREG_MASK)

#define CPE_PMC_P31_DPOL_MASK                    (0x80U)
#define CPE_PMC_P31_DPOL_SHIFT                   (7U)
#define CPE_PMC_P31_DPOL_WIDTH                   (1U)
#define CPE_PMC_P31_DPOL(x)                      (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P31_DPOL_SHIFT)) & CPE_PMC_P31_DPOL_MASK)

#define CPE_PMC_P31_UA_MASK                      (0x100U)
#define CPE_PMC_P31_UA_SHIFT                     (8U)
#define CPE_PMC_P31_UA_WIDTH                     (1U)
#define CPE_PMC_P31_UA(x)                        (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P31_UA_SHIFT)) & CPE_PMC_P31_UA_MASK)

#define CPE_PMC_P31_AO_MASK                      (0x200U)
#define CPE_PMC_P31_AO_SHIFT                     (9U)
#define CPE_PMC_P31_AO_WIDTH                     (1U)
#define CPE_PMC_P31_AO(x)                        (((uint32_t)(((uint32_t)(x)) << CPE_PMC_P31_AO_SHIFT)) & CPE_PMC_P31_AO_MASK)
/*! @} */

/*! @name ITCTRL - Integration Mode Control Register */
/*! @{ */

#define CPE_PMC_ITCTRL_IME_MASK                  (0x1U)
#define CPE_PMC_ITCTRL_IME_SHIFT                 (0U)
#define CPE_PMC_ITCTRL_IME_WIDTH                 (1U)
#define CPE_PMC_ITCTRL_IME(x)                    (((uint32_t)(((uint32_t)(x)) << CPE_PMC_ITCTRL_IME_SHIFT)) & CPE_PMC_ITCTRL_IME_MASK)
/*! @} */

/*! @name CLAIMSET - Claim Tag Set Register */
/*! @{ */

#define CPE_PMC_CLAIMSET_SET_MASK                (0xFU)
#define CPE_PMC_CLAIMSET_SET_SHIFT               (0U)
#define CPE_PMC_CLAIMSET_SET_WIDTH               (4U)
#define CPE_PMC_CLAIMSET_SET(x)                  (((uint32_t)(((uint32_t)(x)) << CPE_PMC_CLAIMSET_SET_SHIFT)) & CPE_PMC_CLAIMSET_SET_MASK)
/*! @} */

