zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CPE_PMC.h
/*! @name CLAIMCLR - Claim Tag Clear Register */
/*! @{ */

#define CPE_PMC_CLAIMCLR_CLR_MASK                (0xFU)
#define CPE_PMC_CLAIMCLR_CLR_SHIFT               (0U)
#define CPE_PMC_CLAIMCLR_CLR_WIDTH               (4U)
#define CPE_PMC_CLAIMCLR_CLR(x)                  (((uint32_t)(((uint32_t)(x)) << CPE_PMC_CLAIMCLR_CLR_SHIFT)) & CPE_PMC_CLAIMCLR_CLR_MASK)
/*! @} */

/*! @name DEVAFF0 - Device Affinity 0 Register */
/*! @{ */

#define CPE_PMC_DEVAFF0_Aff0_MASK                (0xFFU)
#define CPE_PMC_DEVAFF0_Aff0_SHIFT               (0U)
#define CPE_PMC_DEVAFF0_Aff0_WIDTH               (8U)
#define CPE_PMC_DEVAFF0_Aff0(x)                  (((uint32_t)(((uint32_t)(x)) << CPE_PMC_DEVAFF0_Aff0_SHIFT)) & CPE_PMC_DEVAFF0_Aff0_MASK)

#define CPE_PMC_DEVAFF0_Aff1_MASK                (0xFF00U)
#define CPE_PMC_DEVAFF0_Aff1_SHIFT               (8U)
#define CPE_PMC_DEVAFF0_Aff1_WIDTH               (8U)
#define CPE_PMC_DEVAFF0_Aff1(x)                  (((uint32_t)(((uint32_t)(x)) << CPE_PMC_DEVAFF0_Aff1_SHIFT)) & CPE_PMC_DEVAFF0_Aff1_MASK)

#define CPE_PMC_DEVAFF0_Aff2_MASK                (0xFF0000U)
#define CPE_PMC_DEVAFF0_Aff2_SHIFT               (16U)
#define CPE_PMC_DEVAFF0_Aff2_WIDTH               (8U)
#define CPE_PMC_DEVAFF0_Aff2(x)                  (((uint32_t)(((uint32_t)(x)) << CPE_PMC_DEVAFF0_Aff2_SHIFT)) & CPE_PMC_DEVAFF0_Aff2_MASK)

#define CPE_PMC_DEVAFF0_MT_MASK                  (0x1000000U)
#define CPE_PMC_DEVAFF0_MT_SHIFT                 (24U)
#define CPE_PMC_DEVAFF0_MT_WIDTH                 (1U)
#define CPE_PMC_DEVAFF0_MT(x)                    (((uint32_t)(((uint32_t)(x)) << CPE_PMC_DEVAFF0_MT_SHIFT)) & CPE_PMC_DEVAFF0_MT_MASK)

#define CPE_PMC_DEVAFF0_U_MASK                   (0x40000000U)
#define CPE_PMC_DEVAFF0_U_SHIFT                  (30U)
#define CPE_PMC_DEVAFF0_U_WIDTH                  (1U)
#define CPE_PMC_DEVAFF0_U(x)                     (((uint32_t)(((uint32_t)(x)) << CPE_PMC_DEVAFF0_U_SHIFT)) & CPE_PMC_DEVAFF0_U_MASK)

#define CPE_PMC_DEVAFF0_M_MASK                   (0x80000000U)
#define CPE_PMC_DEVAFF0_M_SHIFT                  (31U)
#define CPE_PMC_DEVAFF0_M_WIDTH                  (1U)
#define CPE_PMC_DEVAFF0_M(x)                     (((uint32_t)(((uint32_t)(x)) << CPE_PMC_DEVAFF0_M_SHIFT)) & CPE_PMC_DEVAFF0_M_MASK)
/*! @} */

/*! @name DEVAFF1 - Device Affinity 1 Register */
/*! @{ */

#define CPE_PMC_DEVAFF1_DEVAFF1_MASK             (0xFFFFFFFFU)
#define CPE_PMC_DEVAFF1_DEVAFF1_SHIFT            (0U)
#define CPE_PMC_DEVAFF1_DEVAFF1_WIDTH            (32U)
#define CPE_PMC_DEVAFF1_DEVAFF1(x)               (((uint32_t)(((uint32_t)(x)) << CPE_PMC_DEVAFF1_DEVAFF1_SHIFT)) & CPE_PMC_DEVAFF1_DEVAFF1_MASK)
/*! @} */

/*! @name DEVARCH - Device Architecture Register */
/*! @{ */

#define CPE_PMC_DEVARCH_ARCHID_MASK              (0xFFFFU)
#define CPE_PMC_DEVARCH_ARCHID_SHIFT             (0U)
#define CPE_PMC_DEVARCH_ARCHID_WIDTH             (16U)
#define CPE_PMC_DEVARCH_ARCHID(x)                (((uint32_t)(((uint32_t)(x)) << CPE_PMC_DEVARCH_ARCHID_SHIFT)) & CPE_PMC_DEVARCH_ARCHID_MASK)

#define CPE_PMC_DEVARCH_REVISION_MASK            (0xF0000U)
#define CPE_PMC_DEVARCH_REVISION_SHIFT           (16U)
#define CPE_PMC_DEVARCH_REVISION_WIDTH           (4U)
#define CPE_PMC_DEVARCH_REVISION(x)              (((uint32_t)(((uint32_t)(x)) << CPE_PMC_DEVARCH_REVISION_SHIFT)) & CPE_PMC_DEVARCH_REVISION_MASK)

#define CPE_PMC_DEVARCH_PRESENT_MASK             (0x100000U)
#define CPE_PMC_DEVARCH_PRESENT_SHIFT            (20U)
#define CPE_PMC_DEVARCH_PRESENT_WIDTH            (1U)
#define CPE_PMC_DEVARCH_PRESENT(x)               (((uint32_t)(((uint32_t)(x)) << CPE_PMC_DEVARCH_PRESENT_SHIFT)) & CPE_PMC_DEVARCH_PRESENT_MASK)

#define CPE_PMC_DEVARCH_ARCHITECT_MASK           (0xFFE00000U)
#define CPE_PMC_DEVARCH_ARCHITECT_SHIFT          (21U)
#define CPE_PMC_DEVARCH_ARCHITECT_WIDTH          (11U)
#define CPE_PMC_DEVARCH_ARCHITECT(x)             (((uint32_t)(((uint32_t)(x)) << CPE_PMC_DEVARCH_ARCHITECT_SHIFT)) & CPE_PMC_DEVARCH_ARCHITECT_MASK)
/*! @} */

/*! @name DEVTYPE - Device Type Identifier Register */
/*! @{ */

#define CPE_PMC_DEVTYPE_MAJOR_MASK               (0xFU)
#define CPE_PMC_DEVTYPE_MAJOR_SHIFT              (0U)
#define CPE_PMC_DEVTYPE_MAJOR_WIDTH              (4U)
#define CPE_PMC_DEVTYPE_MAJOR(x)                 (((uint32_t)(((uint32_t)(x)) << CPE_PMC_DEVTYPE_MAJOR_SHIFT)) & CPE_PMC_DEVTYPE_MAJOR_MASK)

#define CPE_PMC_DEVTYPE_SUB_MASK                 (0xF0U)
#define CPE_PMC_DEVTYPE_SUB_SHIFT                (4U)
#define CPE_PMC_DEVTYPE_SUB_WIDTH                (4U)
#define CPE_PMC_DEVTYPE_SUB(x)                   (((uint32_t)(((uint32_t)(x)) << CPE_PMC_DEVTYPE_SUB_SHIFT)) & CPE_PMC_DEVTYPE_SUB_MASK)
/*! @} */

/*! @name PIDR4 - Peripheral Identification Register 4 */
/*! @{ */

#define CPE_PMC_PIDR4_DES_2_MASK                 (0xFU)
#define CPE_PMC_PIDR4_DES_2_SHIFT                (0U)
#define CPE_PMC_PIDR4_DES_2_WIDTH                (4U)
#define CPE_PMC_PIDR4_DES_2(x)                   (((uint32_t)(((uint32_t)(x)) << CPE_PMC_PIDR4_DES_2_SHIFT)) & CPE_PMC_PIDR4_DES_2_MASK)

#define CPE_PMC_PIDR4_SIZE_MASK                  (0xF0U)
#define CPE_PMC_PIDR4_SIZE_SHIFT                 (4U)
#define CPE_PMC_PIDR4_SIZE_WIDTH                 (4U)
#define CPE_PMC_PIDR4_SIZE(x)                    (((uint32_t)(((uint32_t)(x)) << CPE_PMC_PIDR4_SIZE_SHIFT)) & CPE_PMC_PIDR4_SIZE_MASK)
/*! @} */

/*! @name PIDR0 - Peripheral Identification Register 0 */
/*! @{ */

#define CPE_PMC_PIDR0_PART_0_MASK                (0xFFU)
#define CPE_PMC_PIDR0_PART_0_SHIFT               (0U)
#define CPE_PMC_PIDR0_PART_0_WIDTH               (8U)
#define CPE_PMC_PIDR0_PART_0(x)                  (((uint32_t)(((uint32_t)(x)) << CPE_PMC_PIDR0_PART_0_SHIFT)) & CPE_PMC_PIDR0_PART_0_MASK)
/*! @} */

/*! @name PIDR1 - Peripheral Identification Register 1 */
/*! @{ */

#define CPE_PMC_PIDR1_PART_1_MASK                (0xFU)
#define CPE_PMC_PIDR1_PART_1_SHIFT               (0U)
#define CPE_PMC_PIDR1_PART_1_WIDTH               (4U)
#define CPE_PMC_PIDR1_PART_1(x)                  (((uint32_t)(((uint32_t)(x)) << CPE_PMC_PIDR1_PART_1_SHIFT)) & CPE_PMC_PIDR1_PART_1_MASK)

#define CPE_PMC_PIDR1_DES_0_MASK                 (0xF0U)
#define CPE_PMC_PIDR1_DES_0_SHIFT                (4U)
#define CPE_PMC_PIDR1_DES_0_WIDTH                (4U)
#define CPE_PMC_PIDR1_DES_0(x)                   (((uint32_t)(((uint32_t)(x)) << CPE_PMC_PIDR1_DES_0_SHIFT)) & CPE_PMC_PIDR1_DES_0_MASK)
/*! @} */

/*! @name PIDR2 - Peripheral Identification Register 2 */
/*! @{ */

#define CPE_PMC_PIDR2_DES_1_MASK                 (0x7U)
#define CPE_PMC_PIDR2_DES_1_SHIFT                (0U)
#define CPE_PMC_PIDR2_DES_1_WIDTH                (3U)
#define CPE_PMC_PIDR2_DES_1(x)                   (((uint32_t)(((uint32_t)(x)) << CPE_PMC_PIDR2_DES_1_SHIFT)) & CPE_PMC_PIDR2_DES_1_MASK)

