zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CPE_PMC.h
#define CPE_PMC_PIDR2_JEDEC_MASK                 (0x8U)
#define CPE_PMC_PIDR2_JEDEC_SHIFT                (3U)
#define CPE_PMC_PIDR2_JEDEC_WIDTH                (1U)
#define CPE_PMC_PIDR2_JEDEC(x)                   (((uint32_t)(((uint32_t)(x)) << CPE_PMC_PIDR2_JEDEC_SHIFT)) & CPE_PMC_PIDR2_JEDEC_MASK)

#define CPE_PMC_PIDR2_REVISION_MASK              (0xF0U)
#define CPE_PMC_PIDR2_REVISION_SHIFT             (4U)
#define CPE_PMC_PIDR2_REVISION_WIDTH             (4U)
#define CPE_PMC_PIDR2_REVISION(x)                (((uint32_t)(((uint32_t)(x)) << CPE_PMC_PIDR2_REVISION_SHIFT)) & CPE_PMC_PIDR2_REVISION_MASK)
/*! @} */

/*! @name PIDR3 - Peripheral Identification Register 3 */
/*! @{ */

#define CPE_PMC_PIDR3_CMOD_MASK                  (0xFU)
#define CPE_PMC_PIDR3_CMOD_SHIFT                 (0U)
#define CPE_PMC_PIDR3_CMOD_WIDTH                 (4U)
#define CPE_PMC_PIDR3_CMOD(x)                    (((uint32_t)(((uint32_t)(x)) << CPE_PMC_PIDR3_CMOD_SHIFT)) & CPE_PMC_PIDR3_CMOD_MASK)

#define CPE_PMC_PIDR3_REVAND_MASK                (0xF0U)
#define CPE_PMC_PIDR3_REVAND_SHIFT               (4U)
#define CPE_PMC_PIDR3_REVAND_WIDTH               (4U)
#define CPE_PMC_PIDR3_REVAND(x)                  (((uint32_t)(((uint32_t)(x)) << CPE_PMC_PIDR3_REVAND_SHIFT)) & CPE_PMC_PIDR3_REVAND_MASK)
/*! @} */

/*! @name CIDR0 - Component Identification Register 0 */
/*! @{ */

#define CPE_PMC_CIDR0_PRMBL_0_MASK               (0xFFU)
#define CPE_PMC_CIDR0_PRMBL_0_SHIFT              (0U)
#define CPE_PMC_CIDR0_PRMBL_0_WIDTH              (8U)
#define CPE_PMC_CIDR0_PRMBL_0(x)                 (((uint32_t)(((uint32_t)(x)) << CPE_PMC_CIDR0_PRMBL_0_SHIFT)) & CPE_PMC_CIDR0_PRMBL_0_MASK)
/*! @} */

/*! @name CIDR1 - Component Identification Register 1 */
/*! @{ */

#define CPE_PMC_CIDR1_PRMBL_1_MASK               (0xFU)
#define CPE_PMC_CIDR1_PRMBL_1_SHIFT              (0U)
#define CPE_PMC_CIDR1_PRMBL_1_WIDTH              (4U)
#define CPE_PMC_CIDR1_PRMBL_1(x)                 (((uint32_t)(((uint32_t)(x)) << CPE_PMC_CIDR1_PRMBL_1_SHIFT)) & CPE_PMC_CIDR1_PRMBL_1_MASK)

#define CPE_PMC_CIDR1_CLASS_MASK                 (0xF0U)
#define CPE_PMC_CIDR1_CLASS_SHIFT                (4U)
#define CPE_PMC_CIDR1_CLASS_WIDTH                (4U)
#define CPE_PMC_CIDR1_CLASS(x)                   (((uint32_t)(((uint32_t)(x)) << CPE_PMC_CIDR1_CLASS_SHIFT)) & CPE_PMC_CIDR1_CLASS_MASK)
/*! @} */

/*! @name CIDR2 - Component Identification Register 2 */
/*! @{ */

#define CPE_PMC_CIDR2_PRMBL_2_MASK               (0xFFU)
#define CPE_PMC_CIDR2_PRMBL_2_SHIFT              (0U)
#define CPE_PMC_CIDR2_PRMBL_2_WIDTH              (8U)
#define CPE_PMC_CIDR2_PRMBL_2(x)                 (((uint32_t)(((uint32_t)(x)) << CPE_PMC_CIDR2_PRMBL_2_SHIFT)) & CPE_PMC_CIDR2_PRMBL_2_MASK)
/*! @} */

/*! @name CIDR3 - Component Identification Register 3 */
/*! @{ */

#define CPE_PMC_CIDR3_PRMBL_3_MASK               (0xFFU)
#define CPE_PMC_CIDR3_PRMBL_3_SHIFT              (0U)
#define CPE_PMC_CIDR3_PRMBL_3_WIDTH              (8U)
#define CPE_PMC_CIDR3_PRMBL_3(x)                 (((uint32_t)(((uint32_t)(x)) << CPE_PMC_CIDR3_PRMBL_3_SHIFT)) & CPE_PMC_CIDR3_PRMBL_3_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group CPE_PMC_Register_Masks */

/*!
 * @}
 */ /* end of group CPE_PMC_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K566_CPE_PMC_H_) */
